{
    "title": "Apartmentalize 2023: Top Four Multifamily Insights",
    "author": "KT Heins-Nagamoto",
    "date": "June 26, 2023",
    "summary": "This article discusses key insights from Apartmentalize 2023, focusing on operational efficiency and innovation in multifamily housing, highlighting four major takeaways from the event.",
    "main_content": "# Apartmentalize 2023: Top Four Multifamily Insights\n\nWith rent growth slowing, all eyes were on operational efficiency and innovation at [Apartmentalize 2023](https://apartmentalize.naahq.org/), the premier event for the real estate and multifamily housing industry that recently took place in Atlanta, GA.\n\nIndustry leaders, experts, and enthusiasts gathered to explore the latest trends, exchange knowledge, and collaborate. This year’s line-up of panels and presentations highlighted multifamily’s biggest hurdles and potential solutions, including staffing, retention, centralization, and automation. Get the insider’s view of NAA, with four key takeaways from the education sessions led by EliseAI partners.\n\n## Four Major Takeaways From NAA 2023\n\n**1. Centralization is not a buzzword, but an inevitability**  \nFor many, centralization starts with technology. However, this year’s conference marked a shift in the multifamily industry’s approach. Owners and operators know the many benefits of centralization by now but are still struggling to implement a centralized model. Sure, there is an oversaturation of technology available to get started, but sustaining long-term operational efficiencies and transitioning staff… that’s another thing altogether.\n\nThe majority of education sessions focused less on proving centralization as “worth it” and more on developing a unique model. (Example: Should you be using a podding or nesting approach?) Prominent speakers addressed the larger challenges of centralizing leasing and resident services. How do you introduce new operational models to your people? How do you use centralization to specialize roles and nurture your talent? What model is right for your setup or asset type?\n\nOver 150 operators/owners utilize EliseAI to automate leasing at multiple properties, unlocking data that helps them make informed decisions about how to refocus roles off-site, and what aspects of leasing can they change to improve their renter satisfaction. However, automation is a tool that supports the model, not centralization itself.\n\n**2. With Technological Advancements, Quality Data Is Easier To Aggregate**  \nData collection at every step of leasing and at every resident touchpoint is becoming more actionable, thanks to automation. Overall, gathering data, reporting, and analysis has become easier to execute and less time-consuming. Experts from Avenue5 Residential and Bozzuto shared the tools like EliseAI that they’re using to collect and access data, identifying what needs to evolve operationally immediately to improve customer experience and remain reputable.\n\nSr. Director of Marketing & Customer Experience at Bozzuto, [Jenna Miller](https://apt23.mapyourshow.com/8_0/sessions/speaker-details.cfm?speakerid=39), knows a thing or two about routinely asking for renter reviews. She shared insights about Bozzuto’s method of collecting feedback and mapping the renter journey using qualified data.\n\n[Bozzuto Listens](https://bozzutolistens.com/) is a custom feedback channel that Bozzuto developed to give customers a more efficient way to share feedback, with the option to do so either publicly on a review site or privately through the platform itself. That information is automatically routed to team members to identify and address gaps in the renter experience. This has enabled Bozzuto to solve systemic problems in their operational models, improve communities, and boost resident retention rate. Soon, Bozzuto will be able to aggregate Bozzuto Listens feedback with their review and survey data, to help the on-site teams at each property identify and prioritize opportunities to optimize the customer experience.\n\n**3. Automating Resident Services**  \nChatGPT has sparked a fire in multifamily. Education sessions highlighted all the ways you could apply AI to leasing operations, as well as the resident experience from move-in to renewals. Owners/operators are even becoming more well-versed in the different models, knowing the difference between a [basic chatbot and an advanced conversational AI platform](https://www.eliseai.com/blog/whats-the-difference-between-eliseai-and-chatgpt).\n\nIndustry demand is why EliseAI is investing so much into resident management. We are the only AI platform provider to be rapidly developing artificial intelligence built to automate pre-collections, reduce delinquencies, decrease bad debt, and increase resident retention. Streamlining cashflow and creating a positive NOI is an absolute priority.\n\n[Learn how Cardinal Uses EliseCollect To Automate Payments](https://storage.pardot.com/973103/1680617274NZucNyMN/Cardinal_Group_With_EliseCollect.pdf)\n\n**4. Automation Boosts Staff Retention And Doesn’t Replace Teams**  \nThe modern leasing agent wants more from their position than just a paycheck. Experts at NAA reiterated that it’s important to develop a natural career progression for a leasing agent as agents express interest in responsibilities outside of their current role, like marketing, accounting, and event planning.\n\nCentralization has automated routine tasks that can take up 2-3 hours daily for onsite teams. This gives owners/operators the opportunity to rethink the role of an agent or associate. Traditional onsite roles have evolved into more specific on and offsite roles, like delinquency specialists, resident concierges, experience liaisons, event managers, and more. While many would assume that centralization tech like AI is replacing people, AI has enabled career pathing, giving people more freedom to 1) operate offsite with flexible hours and 2) develop a speciality based on talent or interest. Not only does this cut costs for owners/operators, but it helps them retain their talented staff long-term.\n\nApartmentalize 2023 provided a glimpse into the future of multifamily housing, with key takeaways to share from the EliseAI team: Centralization is inevitable; Data is king; and Automation is going to empower, not replace, teams.\n\nWe call every conference a success, but NAA always sheds light on how forward-thinking the multifamily housing industry has truly become. The industry is positioning itself to embrace innovation and pivot in the face of economic challenges. See you next year, Apartmentalize!"
}