{
    "title": "EliseAI Raises $35M Series C to Continue Revolutionizing Real Estate",
    "author": "Andrew Korn",
    "date": "June 6, 2023",
    "summary": "EliseAI has successfully raised $35 million in a Series C funding round, aimed at enhancing its AI technology for the rental housing industry.",
    "main_content": "# EliseAI Raises $35M Series C to Continue Revolutionizing Real Estate\n\nNew York City, June 7th, 2023 – EliseAI, the premier conversational AI platform for real estate, announced today its $35 million Series C fundraising round led by Point72 Private Investments, with participation from Koch Real Estate Investments and existing investors Golden Seeds, Navitas Capital, JLL Spark, and DivcoWest. In conjunction with the investment, Eddie Kang, who leads growth-stage investment activities for Point72 Private Investments, joins EliseAI’s board of directors.\n\nFounded in 2017, EliseAI has become the largest and most sophisticated AI platform serving the multifamily and single-family rental housing industry, the largest commercial real estate asset class in the U.S. The company’s products automate conversations between potential and current renters and apartment buildings via SMS, email, phone, and webchat and automate workflows through integrations with key software systems. The company currently serves 1.5 million units across 200 customers, including leading owners and operators such as Asset Living, Bozzuto, and Venterra.\n\n“We started this company with the vision of using the most advanced technology to transform the industries fundamental to our lives,” said Minna Song, Co-Founder and CEO of EliseAI. “We are incredibly proud of the change we have driven in the real estate industry over the last 6 years. We are thrilled to bring on new partners to enable us to continue to innovate and push into new markets.”\n\n“We are incredibly excited to be partnering with EliseAI for the next step of their journey,” said Eddie Kang, partner at Point72 Private Investments. “We believe they have the right team, experience, and technology to bring cutting-edge conversational AI to the real estate industry and unlock a new era of business efficiency.”\n\nThe funding comes amidst a long-term shift towards rental housing in the US, underpinned by a growing population, increasing migration to urban areas, and rising home prices. As rental housing serves increasingly young and tech-adept populations, there is a higher expectation for seamless tech-enabled experiences.\n\nEliseAI has driven accelerated adoption of such tech-enabled experiences across the real estate industry and will use the funding for continued product development. The company also plans to expand into new verticals, such as healthcare.\n\n**About EliseAI**  \nEliseAI is a technology company based in New York City dedicated to building the most advanced conversational artificial intelligence platform in the world, enabling enterprises to achieve new levels of automation and customer service. To learn more visit [www.eliseai.com](https://www.eliseai.com).\n\n**Contact**  \nAndrew Korn  \n646-593-7512  \npress@eliseai.com"
}