{
    "title": "EliseAI Surpasses 1 Million Multifamily Units On Its Platform",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "EliseAI has reached a significant milestone by surpassing 1 million multifamily units on its AI platform, highlighting its leadership in the real estate tech industry.",
    "main_content": "# EliseAI Surpasses 1 Million Multifamily Units On Its Platform\n\nEliseAI is thrilled to announce that it recently surpassed 1 million multifamily units on its AI platform. This milestone underscores the company’s position as the leading provider of conversational artificial intelligence for the multifamily industry.\n\n“**We are incredibly proud to pass the 1 million unit mark. This is a testament to the tireless efforts of our team and all of our partners. When we first started EliseAI in 2017, AI was largely unknown in multifamily. 1 million units later it has become a must-have for everyone in the industry,**” said Minna Song, co-founder and CEO of EliseAI.\n\nThis success comes during a year of transformative change for the industry as post-pandemic trends towards automation and centralization have continued to accelerate, driving adoption of artificial intelligence to unlock business efficiencies.\n\nFrom its inception, EliseAI has focused on delivering the highest possible AI conversational quality, making significant investments in research and development in the field of machine learning. “**A lot of the ongoing value of artificial intelligence and machine learning lies in continuous improvement,**” said Tony Stoyanov, co-founder and CTO of EliseAI. “**With true machine learning, each conversation helps the AI to learn and improve, so the more conversations you have, the better your AI will be. Our long history and high conversation volume enable us to improve our conversation quality at an ever increasing rate.**”\n\nAlongside these consistent improvements in conversation quality, EliseAI has also released a number of transformative new features, including EliseCRM, cross-selling within portfolios, and newly announced integrations with Knock, Funnel, and Resman. These releases broaden its product offering and enable more owners and management companies to partner with EliseAI.\n\nTo learn more about how conversational artificial intelligence can transform your multifamily operations, contact [sales@eliseai.com](mailto:sales@eliseai.com).\n\n---\n\n**About EliseAI**  \nEliseAI is a technology company based in New York City dedicated to building the world’s most advanced conversational artificial intelligence platform to enable a new level of business automation. EliseAI’s first product is a virtual leasing assistant for rental housing that helps real estate management companies of all sizes provide exceptional customer service and maximize revenue. For more information, please visit eliseai.com."
}