{
    "title": "EliseAI Raises $75 Million Series D Round",
    "author": "Arianna Paranzino",
    "date": "August 14, 2024",
    "summary": "EliseAI announces a successful Series D funding round of $75 million, achieving a valuation of over $1 billion and reinforcing its position as a leader in AI solutions for the housing industry.",
    "main_content": "# EliseAI Raises $75 Million Series D Round\n\nEliseAI, the largest and most advanced conversational AI platform for the housing industry, today announced its Series D raise of $75 million at a valuation in excess of $1 billion, making it the latest New York City-based unicorn. The round was led by Sapphire Ventures, with participation from existing investors Navitas Capital, Point72 Private Investments, DivcoWest Ventures, and Koch Real Estate Investments.\n\n---\n\nFounded in 2017 by Minna Song (CEO) and Tony Stoyanov (CTO), EliseAI is driven by its mission to revolutionize industries that are fundamental to our lives. Already the leader in automating the housing sector through AI, EliseAI expanded into healthcare in 2023. The company uses AI to increase the ability of these sectors to serve more people and to elevate the quality of the service they provide to consumers, enhancing the lives of millions.\n\n---\n\n\"Essential industries like housing and healthcare are facing serious operational challenges and financial strain. Our mission to tackle these problems authentically resonates with everyone at our company. We are committed to improving how these industries operate, making them more sustainable and accessible,\" said Minna Song, Co-Founder and CEO of EliseAI. \"We are excited to partner with the Sapphire Ventures team given their track record of working with B2B software companies to achieve extraordinary success.\"\n\n---\n\nThis funding comes as EliseAI has seen accelerating growth at scale and tremendous momentum across its business, with proof-points of success including:\n\n- Growth in Annual Recurring Revenue of more than 2.5x since its Series C last year;\n- Partnering with 70% of the top 50 multifamily owners and operators and leading single-family rental companies;\n- Customers including Bozzuto, Equity Residential, AvalonBay, Invitation Homes, and Asset Living rely on EliseAI to enhance operational efficiency, ultimately increasing their capacity to deliver better service to more people at a lower cost;\n- Active in 1 out of every 12 multifamily apartment units in the U.S.\n\n---\n\n\"EliseAI's multimodal AI platform has revolutionized customer interactions in the housing industry, we believe setting the standard for how purpose-built AI can deliver clear, measurable results with high accuracy and compliance to industry regulations. I am thrilled to partner with Minna, Tony, and their team as they continue to transform the housing industry and tackle other core industries like healthcare,\" said Cathy Gao, Partner at Sapphire Ventures and new EliseAI board member.\n\n---\n\nEliseAI first reshaped the housing industry, and today the company is the largest AI-native company in the space, serving millions of rental units nationwide. The company’s complete AI platform automates property workflows and communications with renters throughout their entire journey:\n\n- [LeasingAI](https://www.eliseai.com/leasingai) manages all prospects 24/7/365 resulting in 125%+ greater lease conversion with 90%+ of work automated;\n- [ResidentAI](https://www.eliseai.com/residentai) manages all resident communications, resulting in 40%+ greater engagement, a 50%+ reduction in delinquencies, and a 15 day acceleration in renewal notices;\n- [EliseCRM](https://www.eliseai.com/elisecrm), the industry’s most advanced CRM, is _free_ and is a hub for all prospect and resident information, workflows, and reporting;\n- All products are delivered with full AI over email, SMS, webchat, and voice. Elise offers the only true VoiceAI in the industry with real-time human-like replies to _any_ question;\n- EliseAI is the only AI product in the space to work with _all_ property types, from [conventional multifamily](https://www.eliseai.com/asset/conventional) to scattered site and [single family properties](https://www.eliseai.com/asset/single-family), [student](https://www.eliseai.com/asset/student) and [affordable](https://www.eliseai.com/asset/affordable) properties, and properties managed both locally and through [centralization](https://www.eliseai.com/centralization).\n\n---\n\n\"Partnering with EliseAI has transformed our community operations by boosting lead conversion and operational efficiency. Their technology not only increases conversion rates and saves time but also provides detailed metrics and reporting across all our communities,\" said Faith Duplantis, Senior Marketing Manager at Asset Living. \"Their suite of tools enhances daily operations and provides personalized lead nurturing, meeting the immediate needs of prospects and residents with their innovative AI, ensuring our ongoing success.\"\n\n---\n\nThe company brought its technology to healthcare in 2023 and today serves a number of leading providers with its [HealthAI](https://www.eliseai.com/healthai) offering to automate non-clinical tasks including patient conversations, appointment scheduling, and billing and payments. HealthAI handles 95% of patient inquiries 24/7/365 with no wait time. EliseAI integrates with many leading EHR, PMS, and RCM solutions to ensure a seamless experience with full HIPAA and SOC2 Type II compliance.\n\n---\n\nThe company is seeing extraordinary demand for its innovative technology in both industries and is one of the few vertical-focused AI companies operating at scale. EliseAI will use the proceeds from the raise to continue to rapidly expand its team, invest in continued product innovation, and build its leading portfolio of industry partnerships that enable it to work effectively with other products and systems to maximize value.\n\n---\n\nEliseAI has over 150 employees at its vibrant headquarters in NYC and is currently hiring for roles across Engineering and Product, Sales and Marketing, and Operations. For career opportunities, visit [https://www.eliseai.com/careers](https://www.eliseai.com/careers).\n\n---\n\n**ABOUT SAPPHIRE**  \nSapphire is a global software venture capital firm with more than $10 billion in AUM and team members across Austin, London, Menlo Park and San Francisco. For over a decade, Sapphire has partnered with visionary management teams and venture funds to back companies of consequence. Since its founding, Sapphire has invested in more than 170 companies globally resulting in more than 30 Public Listings and 45 acquisitions. The firm’s investment strategies — Sapphire Ventures, Sapphire Partners and Sapphire Sport — are focused on scaling companies and venture funds, elevating them to become category leaders. Sapphire’s Portfolio Growth team of experienced operators delivers a strategic blend of value-add services, tools and resources designed to support portfolio company leaders as they scale."
}