{
    "title": "EliseAI Selected As a Winner of One of the Most Prestigious Awards in Real Estate Tech",
    "author": "KT Heins-Nagamoto",
    "date": "September 27, 2023",
    "summary": "EliseAI has been awarded the 10th Annual Real Estate Tech Awards in the Mid-Market Growth category, recognizing its innovative contributions to the real estate technology sector.",
    "main_content": "# EliseAI Selected As a Winner of One of the Most Prestigious Awards in Real Estate Tech\n\n**New York, NY (September 20, 2023)** — EliseAI, a machine-learning technology company, based in New York City, is pleased to announce that they are a 10th Annual Real Estate Tech Awards (RETAs) winner in the Mid-Market Growth category, presented by [CREtech](https://www.cretech.com), the world’s leading community of professionals devoted to technological innovation in the real estate sector.\n\nIn partnership with [Colliers](https://www.colliers.com/en), the Real Estate Tech Awards are the leading international awards honoring excellence in commercial real estate tech. The awards recognize the most cutting-edge companies that have played an integral role in advancing tech in the industry throughout the year. Backed by the leading voices and thought leaders in the commercial real estate tech industry, the awards were open to startups or technology companies servicing the industry.\n\nEliseAI was carefully selected as a winner by the #RETAs elite panel of judges, including leading thought leaders in the real estate tech industry.\n\nThe multifamily industry faces 33% employee turnover rate, and portfolios are rapidly growing to include more single-family homes and affordable homes. As a result, the industry is experiencing unprecedented tech transformation, especially the rapid development of new solutions like AI assistants. EliseAI is a forerunner in building conversational AI for residential real estate, partnering with over 230 of the nation’s top owners and managers. The all-in-one EliseAI platform automates prospect and resident communication and management via email, chat, text message, and most recently phone calls. Unmatched conversational quality makes a positive impact at every touchpoint, with AI that sounds and feels human. Teams save 3 hours on average and operators cut costs while enhancing their ability to centralize and evolve.\n\n“This award validates our team’s dedication and the tremendous growth we’ve experienced in 2023,” EliseAI Head of Operations Francesca Loftus says. “We’re thinking beyond building simple chatbots that provide basic responses, to developing solutions-based AI. Our conversational AI solves problems for renters, anticipating their needs, providing more information, and offering recommendations based on prospect preferences. We’re proud that CRETech has acknowledged the work we’ve done and sees what’s to come for EliseAI.”\n\nFor more information about the Real Estate Tech Awards, [click here](https://www.cretech.com/retas2022).\n\n## About EliseAI\nFounded in 2017 by CEO Minna Song and CTO Tony Stoyanov, EliseAI is the leading AI platform provider for multifamily owners and operators nationwide. Sophisticated, conversational AI empowers property management to automate more tasks for their teams, leading to higher prospect and resident engagement, elevated satisfaction, and more accessibility to housing. From its inception, EliseAI has been dedicated to making a significant impact on as many people as possible.\n\n## About CREtech\nCREtech is Reimagining Real Estate. We are the largest international community of professionals devoted to technological innovation in the real estate sector. Our mission is to help the industry embrace, adopt, and future proof its businesses. Our streaming, live/virtual events, and consulting platform inspires the next generation of ideas, processes, and people to champion the world’s largest asset class.\n\nLearn More: [CREtech.com](https://www.cretech.com/)"
}