{
    "title": "Enhancing Leasing Team Productivity",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "This article discusses the importance of enhancing leasing team productivity through automation and AI, emphasizing the need for leasing teams to focus on closing deals rather than administrative tasks.",
    "main_content": "# Enhancing Leasing Team Productivity\n\nOnsite teams have a lot on their plate. Not only do they need to manage the needs and requests of current residents to make sure their living situation is as satisfactory as possible, but they also need to maintain occupancy and deal with a large number of inbound leads, convert them to tours, and then manage the application and lease closing process.\n\nWith that many items on their plate, it’s easy for leasing team members to get bogged down in the innumerable details of their day-to-day responsibilities and lose sight of what they are really there for: to fill the building with residents. Leasing teams are closers. They are meant to turn prospects into residents. They aren’t meant to spend all of their time with administrative tasks. They need to focus on convincing anyone who comes through the door that they have to live in this building.\n\nBut keeping up with the administrative burden takes up an enormous amount of time that could be spent closing. Responding to emails, handling phone calls, managing a calendar, scheduling tours. It all adds up and takes time away from the core responsibilities of the leasing teams, the duties that enable them to accomplish their key goals that drive the bottom line for third-party management companies and owner-operators alike.\n\nThis is exactly the place where automation can have a transformative effect for a community. By taking the administrative workload off of the shoulders of leasing teams, a conversational artificial intelligence solution can free up leasing teams to focus on closing. Properly understood, artificial intelligence is not a replacement for leasing teams but a companion to leasing teams. It is ultimately a method of enabling leasing teams to achieve their full potential.\n\nEnabling leasing teams has to be a core priority for any property management company or ownership group. Ultimately, if a leasing team is empowered to close deals and drive occupancy then net operating income will follow. If you want to drive NOI, then start with enabling your leasing team."
}