{
    "title": "Envisioning EliseAI’s Future in Healthcare",
    "author": "Nate Shames",
    "date": "May 26, 2023",
    "summary": "This article discusses EliseAI's vision for transforming the healthcare industry through innovative AI solutions, focusing on enhancing patient engagement and operational efficiency.",
    "main_content": "# Envisioning EliseAI’s Future in Healthcare\n\nSince EliseAI was founded in 2017, our mission has always been the same: Transform the business operations of foundational and vital industries through advanced technology.\n\nOur first focus was housing. Housing is one of our fundamental needs as human beings and yet, when we started in 2017, the industry incorporated very little digital technology. Fast forward to today, and we have deployed our conversational AI platform for over 180 multifamily partners to manage 1.4 million units.\n\nWe see the same opportunity for healthcare in 2023 that we saw in housing in 2017: An essential legacy industry that has yet to absorb the transformative potential of new technological developments.\n\n### How EliseAI Is Going To Redefine Access to Healthcare\n\nAI can be a powerful tool in increasing access to healthcare for patients. The challenge for healthcare providers is that patients don’t leave their consumer expectations behind when they interact with their doctor. They expect the same level of service, ease, and accessibility that they receive everywhere else.\n\n68% of patients would prefer a provider that enables them to book, change, or cancel appointments [online](https://www.patientpop.com/blog/patient-experience-stats/) while 69% of patients are more likely to choose providers that communicate with patients via email. 70% of patients would choose a provider that sends emails or texts when it’s time for follow-up or preventative care and 57% *expect* automated text, voice, or email reminders for appointments.\n\nHere’s how EliseAI will bridge these gaps and enable healthcare organizations to provide an entirely new level of service to their patients.\n\n1. **Using Machine Learning For Automating Common Tasks**  \nConversational artificial intelligence can enable an organization to dramatically scale its patient engagement without sacrificing quality or hiring additional staff.\n   \nThrough chat, email, and phone, Elise can triage patient requests, onboard new patients, schedule and reschedule appointments, and explain bills. As a result of its natural language processing technology, Elise sounds and feels human, and is able to remember names and details from interaction to interaction, so that healthcare providers can continue their dedication to providing deeply personalized care.\n   \nExisting patients will notice a difference when our AI takes over an interaction:\n   \n- Patients will get replies to their questions immediately\n- They’ll be able to book appointments faster and rebook 24/7\n- Patients will be able to understand, ask questions, and pay their bills without confusion or frustration\n   \nMeanwhile, new patients will enjoy an elevated experience with their new healthcare provider. With enterprise-grade security and deep integrations with EHR and patient management systems, Elise is ready to manage conversations.\n\n2. **Training With Patient And Admin Data**  \nWe train our AI assistant on a continuous basis, teaching it how to interact with new and existing patients by feeding it multiple sources of data. As a result, our AI is always learning and improving its comprehension and interactions.\n\n3. **Ensuring Accurate Responses Through Seamless Integration**  \nWhen Elise first makes contact with a patient, the AI understands whether the patient is booking an appointment, asking about an item on their bill, or following up on a prescription. To respond accurately, Elise will pool data from a variety of sources including:\n   \n- Electronic health records\n- Calendar/scheduling systems\n- Workforce management systems\n- HIPAA-compliant SMS\n- Patient management systems\n   \nThrough these deep integrations, Elise can:\n   \n- Answer questions about network providers and healthcare coverage\n- Access the provider’s calendar to provide appointment availability\n- Book the appointment and update the provider’s calendar\n- In event of cancellation, follow-up with the patient to rebook\n- Follow-up with the patient post-appointment to take any follow-up questions\n\n### Looking Forward\n\nThe team at EliseAI is excited to step into healthcare, while simultaneously humbled by the size of the problems confronting us. The American healthcare system is plagued by waste and inefficiency.[ Studies of the problem](https://jamanetwork.com/journals/jama/article-abstract/2752664) have assessed that 25% of the overall spend in healthcare, a $4T industry, can be categorized as waste, including $250b of administrative alone, every year. Between 1975 to 2010, the number of doctors in the United States [grew by 150%](https://scholar.harvard.edu/files/poojachandrashekar/files/mar_apr_2019_264-268.pdf) while the number of healthcare administrators grew by 3200%.\n   \nProblems of this scale make the need for solutions even more pressing. And while technology can’t fix all of these problems, it can fix some of them and we are thrilled to do our part. Stay tuned for more exciting updates from our team!"
}