{
    "title": "Five Factors Impacting Healthcare Center Finances",
    "author": "Nate Shames",
    "date": "October 2, 2023",
    "summary": "This article discusses the financial challenges faced by healthcare centers, highlighting five key factors that are affecting their finances and offering insights on how to address these issues.",
    "main_content": "# Five Factors Impacting Healthcare Center Finances\n\nA report released by the [American Hospital Association](https://www.aha.org/guidesreports/2022-09-15-current-state-hospital-finances-fall-2022-update) has recently revealed the dire financial straits that American health systems face since the pandemic. Margins have declined 37% relative to pre-pandemic levels, with over half of hospitals having lost money in 2022.\n\nWhat are the major drivers of the poor financial performance?\n\n## 1. Labor Costs\nLabor costs account for 64% of expense growth from 2021-2022. Kauffmann Hall’s analysis confirms this, with [total direct expense per provider](https://www.kaufmanhall.com/news/2022-worst-financial-year-hospitals-and-health-systems-start-pandemic) increasing to almost $600,000 by the end of 2022. Providers and nurses are also already in short supply, with a tight labor market and burnout to blame for driving the cost per provider so high.\n\n## 2. Additional Contract Support\nWith the turnover rate ranging from 20-23% for both clinical and non-clinical teams [as of 2023](https://www.dailypay.com/resource-center/blog/employee-turnover-rates-in-the-healthcare-industry/), facilities have been forced to bring on more contract nurses and traveling providers to fill the gaps in care. In 2019, hospitals spent a median of 4.7% of their total nurse labor expenses for contract travel nurses. This price has dramatically increased [to a median of 38.6%](https://www.aha.org/guidesreports/2022-04-22-massive-growth-expenses-and-rising-inflation-fuel-continued-financial) in January 2022. Contract agencies also include hiring and additional fees to keep filling these roles for healthcare centers.\n\n## 3. Non-Labor Costs\nThe price of medical equipment, new drugs, operational and clinical services from facility rent, to new laboratory service fees, have all increased due to inflation, making the budgeting process trickier. In particular, the price of pharmaceuticals has skyrocketed, with the price of some critical medications increasing [over 500%](https://www.aha.org/guidesreports/2022-04-22-massive-growth-expenses-and-rising-inflation-fuel-continued-financial). While this cost increase is detrimental to providers and patients, pharmaceutical companies are seeing more profit while inaccess to care increases.\n\n## 4. High Deductible Health Plan Enrollment\nAccording to the latest “[KFF Employer Benefits Survey](https://www.kff.org/health-costs/report/2022-employer-health-benefits-survey/)”, high deductible healthcare plan enrollment is at an all-time high, with more companies offering more affordable, but ultimately less care-conscious options to employees. As a result, the cost of the average deductible per patient has gone up, leaving more patients with medical debt and more financial responsibility for healthcare providers.\n\nHealthcare centers will need to offer a seamless payment experience with multiple points of contact in order to increase on-time payments. This can either be put on your team to manage, or you can use [EliseAI to automate billing and payment communications](https://www.eliseai.com/healthai).\n\n## 5. Increased Admin Hours For Non-Clinical & Clinical Teams\nWith the increased demand of patients, both providers and non-clinical staff are spending more time (⅓ to nearly half of their day) on administrative tasks and bookkeeping. Following up with patients, updating their data in EHR, scheduling appointments and chasing down payments are just a few examples. Artificial intelligence can automate a significant amount of administrative work.\n\nHealthcare organizations are going to have to undergo their own structural transformations in response to avoid further financial stress or even bankruptcy. Cutting providers or anyone involved in provisioning care is a non-starter. Not only would that lower the quality of care and increase stress on providers who are primary revenue generators.\n\nAI can operate at a speed and a scale that humans simply cannot match and for a fraction of the cost, thereby improving patient experience. In doing so, it can help not only reduce costs but put your healthcare facility in a place of profitability and growth."
}