{
    "title": "Follow Ups and the Leasing Process",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "This article discusses the critical role of follow-ups in the leasing process and how they can improve tenant engagement and conversion rates.",
    "main_content": "# Follow Ups and the Leasing Process\n\nLeasing is not a one step process. Given that housing is frequently the largest single expense for an individual or family, people want to feel that they are being taken care of throughout the process. They need to be nurtured and their questions should be answered quickly and promptly. They aren’t just buying a blender. They are finding a home, a place to make their own.\n\n\nBut not only that, prospective tenants are not stopping their search at a single property. They are shopping around, evaluating multiple buildings likely in the same neighborhood. 61% of renters in 2021 submitted 2 or more applications and roughly 30% of renters below the age of 60 sent in 5 or more applications.\n\n\nThe level of personalized service that a building delivers throughout the rental process can often make the difference for a prospective tenant. There’s no more critical element to providing outstanding customer service than regular and relevant follow-up emails. While it seems like a small item, it can make a world of difference to prospects. Follow-ups demonstrate an increased level of care and provide an opportunity to answer any questions and alleviate any concerns that the prospect has after their tour.\n\n\nThe period after a prospect’s tour is the key period of decision-making. That is when the community is freshest in their mind and the onsite staff should be striking while the iron is hot in order to drive occupancy and revenue. This is the perfect time to have a regular cadence of follow-up emails to make sure any difficulties or problems that may have occurred during the tour have been ironed out, to re-emphasize the benefits of the community, and maintain a continuous touchpoint with the prospect.\n\n\nOf course, following up with every single tour, potentially multiple times, can turn into a significant workload for members of the leasing team. That’s where conversational artificial intelligence in the form of an AI leasing agent can have a transformative impact. This technology has the ability to automate conversations and response, including follow-ups, while retaining the human touch that is essential to the leasing process.\n\n\nSources:\n[Zillow Research on Renters' Consumer Housing Trends 2021](https://www.zillow.com/research/renters-consumer-housing-trends-report-2021-29863)"
}