{
    "title": "How the Uberfication Of Customer Expectations Impacts Your Operations",
    "author": "KT Heins-Nagamoto",
    "date": "April 24, 2024",
    "summary": "This article explores the rising expectations of customers in the housing market, drawing parallels with the 'Uberfication' of services, and discusses the operational challenges and opportunities for property management.",
    "main_content": "# Instant Gratification is the New Normal\n\nWhether it's take out, healthcare appointments, shopping, or car services, customers expect their needs to be met quickly and efficiently.\n\nNow, customers seek the same level of efficiency when looking for their new residence. We are actively witnessing the “Uberfication” of leasing in the multifamily industry.\n\n## The Economy Presents Operational Hurdles\n\nThis heightened consumer demand combined with the current housing’s economic climate poses challenges for owners and operators as well as opportunity. Understanding how economic factors affect your operations highlights the distinct challenge of delivering personalized on-demand services.\n\nLet’s paint a post-pandemic picture:\n\nOperating costs are at an all-time high, slashing budgets for marketing and communities. Most housing providers are carrying long-term bad debt and dealing with high mortgage rates.\n\nPost-COVID, employees want to work from home and are retiring early, with different priorities than before, contributing to a 33% multifamily turnover rate.\n\n![Graph 1](https://cdn.prod.website-files.com/63cc1eef179b05d927065991/670fd13b072d7a9186990395_66291bc47f4de2a4295d412a_Graph%25201.png)\n\nRent growth is falling and plateauing, having peaked at 16% growth in 2022. Rent will not be a primary way of profiting from your buildings, and concessions will make less of an impact on the renter decision-making.\n\n![Graph 2](https://cdn.prod.website-files.com/63cc1eef179b05d927065991/670fd13b072d7a918699039a_66291be513f9418db1a2bd8a_Graph%25202.png)\n\nThe housing supply is at an all-time high, with the most available units since 1987. We’re looking at a crowded marketplace with more options for renters than ever before.\n\n![Graph 3](https://cdn.prod.website-files.com/63cc1eef179b05d927065991/670fd13c072d7a91869903c6_66291c2f4098c52231dd5597_Graph%25203.png)\n\nYou’re looking at a crowded marketplace of buildings offering similar rents. In order to boost profitability and reduce bad debt, it’s vital to enhance every touchpoint on the renter’s journey—which might be tough if you’re short-staffed.\n\n## Renters Want On-Demand, Personalized Experiences\n\nWhat exactly do renters want from their home search experience? EliseAI partners have long told us that the housing industry needs to catch up on modernizing the customer experience.\n\nReferencing data from Uber, it’s easy to see why users rely on the ride-sharing application, and how it is conditioning them to expect more from the consumer experience.\n\nSometimes, ease matters more than money. 64% of consumers use apps like Uber because of convenience, while only 15% expect low fares.\n\n![Graph 4](https://cdn.prod.website-files.com/63cc1eef179b05d927065991/670fd13b072d7a918699039b0_66291c670ea872eff23427a3_Graph%25204.png)\n\nSpeed above all: 76% of consumers who use Uber expect 24/7 responsiveness, and 85% of consumers who use Uber expect short wait times.\n\n![Graph 5](https://cdn.prod.website-files.com/63cc1eef179b05d927065991/670fd13b072d7a9186990391_66291c7c69a92ac22a49d32a_Graph%25205.png)\n\nText to talk: While email is still preferred for some messaging, text continues to grow in popularity across all message types. Over half of consumers want to text over email with service providers.\n\n![Graph 6](https://cdn.prod.website-files.com/63cc1eef179b05d927065991/670fd13b072d7a918699039d_66291c9372e9a80b2ef0442b_Graph%25206.png)\n\nIn short, multifamily operators who want to replicate the Uber experience need to…\n\n1. Answer questions and make scheduling appointments easy.\n2. Respond to leads and residents in a matter of minutes, maybe seconds.\n3. Reach their renters on the go—over text and on the phone.\n\nMost operators don’t have access to the same resources as Uber, but that doesn’t mean it’s not possible to meet modern renter’s expectations.\n\n## How is AI Unlocking Efficiency and Increasing Satisfaction?\n\nIn this fast-paced environment, embracing technology isn’t just an option—it’s essential for success. An advanced AI assistant decreases the responsibility of communication on your teams, creating deeper, more frequent touchpoints with renters along their journey. Elise, for example, excels at handling inquiries, scheduling appointments, and providing personalized assistance, freeing up valuable time for on-site teams and even enabling companies to centralize their workforce, rather than deal with high turnover.\n\nAs artificial intelligence only grows more sophisticated, the path towards centralized operations becomes clearer, where technology plays a pivotal role in delivering exceptional experiences to renters."
}