{
    "title": "How EliseAI Is Helping Multifamily Managers Rethink Operations Through Automation",
    "author": "Clay Walsh",
    "date": "January 24, 2025",
    "summary": "This article explores how multifamily managers are leveraging AI and automation to address operational challenges, improve efficiency, and enhance resident experiences.",
    "main_content": "# Introduction\n\nWhen rising operating costs are coupled with the “usual suspects,” including heightened resident expectations and high staff turnover rates, it becomes clear that the traditional property management model and tech stack will struggle to deliver excellent experiences while remaining economically efficient. Some property management companies, including [Venterra Realty](https://venterra.com/), are looking to reinvent how their communities run by leveraging new, [centralized property management strategies](https://www.eliseai.com/centralization) coupled with force-multiplying AI and multifamily automation technology to eliminate tedious manual work and improve capital efficiency. Today, we’ll dive a little deeper into exactly how forward-thinking operators like Venterra are leveraging AI and automation to improve their margins at scale, while simultaneously delivering better prospect and resident experiences.\n\n## The Operational Challenges in Multifamily Property Management\n\nMost multifamily managers are all too familiar with the contemporary operational challenges of the industry, including an onsite turnover crisis, [heightened resident expectations](https://www.eliseai.com/blog/the-uberfication-of-customer-expectations), and an increased push from ownership groups to do more with less. All of these pressures are only exacerbated by the fragmented processes and systems in place at most PMCs. These layers of inefficiency, created by both outdated staffing models and increasingly [complex tech stacks that rely on expensive, single-purpose point solutions](https://www.eliseai.com/gated-reducing-tech-stack), result in time-consuming manual workflows that require agents to spend most of their days managing repeatable, low-value tasks like replying to emails or scheduling appointments.\n\nNew technologies have the potential to free operators from the manual-work hamster wheel. For [Dustin Crandall](https://www.linkedin.com/in/dustin-crandall-b4195b17b/), Director of Customer Experience and Sales Performance at Venterra Realty, the deployment of new technology “starts by examining each touchpoint in the customer journey through the lens of Venterra’s Customer Experience standards which ensures that any decision to automate is grounded in the goal of enhancing, rather than compromising, the experience.” As Dustin relayed to us, Venterra’s approach to “automating repetitive or more predictable interactions has allowed [them] to streamline processes and provide timely resolutions to customer inquiries” in a way that they couldn’t before AI and automation. Fortunately, Venterra’s approach aligns tightly with EliseAI’s vision of the future of property management, as Elise continues to build best-in-class AI and automation platforms.\n\n## Automating Resident and Prospect Communications\n\nEliseAI’s conversational AI tools and [EliseCRM](https://www.eliseai.com/elisecrm) platform are providing an opportunity for operators like Venterra to reimagine their existing workflows, identifying new opportunities for increased automation and scalability. Dustin and his team recognized that “automation is most effective for Venterra when it delivers improved outcomes such as faster response times, more consistent delivery, or greater accessibility.” So rather than rely on onsite teams for lead management, Venterra leverages EliseAI’s products to automate inbound and outbound lead communications while “recognizing that certain interactions—particularly those requiring empathy, adaptability, or nuanced judgment—are better suited for a human touch.” This also goes for touring and applicant communications, as AI can quickly resolve basic questions that prospects would otherwise have to send over to an onsite agent.\n\nOpportunities for increased automation don’t stop on the prospect side of the equation. EliseAI’s products enable fee managers and owner/operators to automate repetitive processes like rent collection, work order submission, renewal offer issuance, and responding to resident inquiries with consistent, accurate, and prompt replies. A crucial part of the automation of both resident and prospect communications is ensuring that the AI is conveying SOP-approved talking points and information to prospective, current, and even past residents. That’s where [EliseCRM](https://www.eliseai.com/blog/elisecrm-feature-deep-dive) comes into play.\n\nUnlike traditional CRMs that manage property settings and information, [EliseCRM empowers your AI](https://www.eliseai.com/blog/ai-first-property-management-crm) to use those settings and community-specific details to automate aspects of operations that have traditionally been manual. By inputting settings like operating guidelines, late fee calculations, renewal timelines, work order categorizations, unit configurations, and more into EliseCRM, fee managers give their AI the information it needs to pull from when managing resident and prospect inquiries. With accurate settings and information your AI can automate most prospect and resident communications, while incorporating self-learning capabilities that allow it to learn from agent responses to provide further opportunities for automation.\n\n## Streamlining Maintenance Operations Through Automation\n\n[Shane Guillot](https://www.linkedin.com/in/shane-guillot/), Director, Centralized Operations at the [Cardinal Group Companies](https://cardinalgroup.com/), sees another opportunity for advancement through automation: improved maintenance & facility management. In Shane’s eyes, “maintenance & facilities, regardless of the industry, is often the last area to benefit from technology enhancements,” while also noting that “maintenance and facilities have the most opportunity to reduce costs while increasing performance and resident satisfaction.” That makes perfect sense—the capital-intensive nature of the maintenance function and growing number of [centralized maintenance teams](https://www.eliseai.com/blog/centralized-maintenance) prove that maintenance is a natural candidate for increased automation, particularly in regards to the increased standardization and visibility automation can bring to the table.\n\nToday, we see that the work order submission workflow is typically self-service, tasking residents with submitting work orders themselves via their resident portal. The fact that this workflow is self-service results in a lack of standardization of categories, subcategories, issue descriptions, and photos for maintenance requests that prevents PMCs from gathering valuable data and insights into the physical health of their communities. Some operators are finding success by automating work order creation through interactions with conversational AI. This both provides a better customer experience by allowing residents to submit a work order through a conversation with an agent, and improves work order standardization by ensuring that work orders of a similar nature are categorized and submitted with consistent information.\n\nAI can also de-escalate maintenance requests by providing self-service options and issue triaging to reduce non-emergency maintenance scheduling and overall work order volume, turning your maintenance team into a well-oiled machine powered by predictive analytics and capacity planning.\n\n## Scaling Centralized Support Through Automation\n\nAutomation is also a crucial part of building a [centralized support](https://www.eliseai.com/blog/takeaways-from-part-four-of-eliseais-centralization-webinar-series-centralized-resident-services) team. As PMCs work to move tasks and responsibilities offsite, automation offers a means of ensuring that work is completed and communications are sent without having to add additional resources to the payroll. Automation also promotes standardization by ensuring prospects and residents receive accurate replies in 5 minutes or less. Instead of having several team members involved in every step of your manual processes, property managers can assign oversight of the automated processes to centralized team members who specialize in the workflows they are monitoring.\n\nOne unfortunate reality is that hiring more headcount often decreases per employee efficiency levels as roles begin to overlap. Hiring your way into managing more communities can be a capital-inefficient way to scale your operations, resulting in increased gross revenue but decreased net operating efficiency. Automation enables centralized teams to handle tasks for multiple properties without needing proportional increases in staff, which reduces overhead and keeps per employee efficiency high.\n\n## The ROI of Automation in Multifamily Operations\n\nAutomation is great in theory, but operators are going to be asked to show ROI on the adoption of new technology to win more business and justify further AI and automation rollouts. In general, ROI considerations for automating aspects of multifamily operations largely fall into one of four categories: cost savings, conversion improvements, operational efficiency, and retention rates. Let’s break down what goes under each bucket, and how you can go about showing ROI for each section.\n\n### Cost Savings\n\nCost saving ROI comes in two forms: reduction in labor costs, and reduction in spending on third-party services. Automation and centralization offer a concrete opportunity for labor cost reduction through flexible staffing as supported by AI, and the elimination of costly overtime hours. For third-party services, automation can offer an opportunity to [decrease the size of your tech stack](https://www.eliseai.com/gated-reducing-tech-stack) by reducing the need for expensive point solutions that overlap with the scope of your AI and EliseCRM. Finally, bringing outsourced work like past resident collections in-house by leveraging the efficiency gains of AI and automation can offer an opportunity to stop spending extra for third-party services.\n\n### Conversion Improvements\n\nAI and automation drive increases in average lead-to-tour and lead-to-lease percentages by [ensuring all your leads are effectively and consistently nurtured](https://www.eliseai.com/blog/reshaping-property-marketing-with-ai-and-automation). In turn, this means management companies have to spend less on marketing to fill their units. Measuring your before and after marketing & resident engagement spending and lead-to-lease conversion rates can show the positive financial impact of AI and automation on your portfolio.\n\n### Operational Efficiency\n\nMeasuring the impact of AI and multifamily automation on your operational efficiency can take a few forms. For one, showing substantial time savings for operational practices like prospect follow-ups or time spent responding to residents through automation can be an indicator that you’re receiving ROI on your AI. Ensure you’re also looking for resident behavioral changes, like improved payment velocity and a reduction in overall delinquency rates after automating rent collection conversations with current and past residents.\n\n### Retention Rates\n\nMeasuring the impact of AI on your retention rates is another strong component of the ROI equation. AI and automation drive decreases in resident turnover rates through improved renewal offer management and conversation quality, ensuring your residents feel listened to and supported. AI and automation can also reduce your staff turnover rate by reducing the amount of tedious manual work your agents are forced to manage.\n\nThinking beyond hard ROI, there’s a variety of long-term strategic benefits that can be gained by adopting AI and automating manual work. For one, utilizing AI and automation can enable you to scale your onsite and corporate support roles more efficiently than hiring more staff. You can also expect to see improved data-collection and data-driven decision-making capabilities as a result of the conversational insights from your automated workflows. Finally, overall employee satisfaction will increase as you reduce friction across departments & eliminate siloed responsibilities and tasks.\n\n## Building a Better Property Management Model with AI and Multifamily Automation\n\nThe future of multifamily is powered by AI and automation. As more and more operators leverage advanced AI technology and increasingly choose to automate low-value work, they’ll continue to delight residents and improve their operating efficiency. Dustin’s framing of this new way of working, focused on using automation to enhance existing customer experience standards, is the thoughtful, customer-centric north star operators should look to follow as they roll out new AI and automation platforms. If you’re looking for the best AI and automation tools in the business to improve your prospect and resident experiences, get in touch with the EliseAI team today."
}