{
    "title": "How Much Does It Really Cost To Use A Call Center",
    "author": "Nate Shames",
    "date": "October 2, 2023",
    "summary": "This article explores the costs and inefficiencies associated with traditional call centers in the healthcare industry and presents conversational AI as a more effective alternative.",
    "main_content": "# The Healthcare Industry and Call Centers\n\nThe healthcare industry is dependent upon call centers. Enjoyable hold music can't overshadow the fact that they are an ineffective and old-fashioned way to engage with patients.\n\nA recent survey of consumers found that over half of consumers said that automated phone systems are the most frustrating part of customer service.\n\nCall centers rely on [complex phone systems](https://assets.ctfassets.net/xj0skx6m69u2/tp7lvOofmLEEU7iPb32Op/7213f9400946c26628be836c565a37ca/future-of-the-contact-center-a-forecast.pdf) operated by a network of agents to solve issues. The quality of service can change from person to person and largely depends on individual personalities and how well each person understands your business. Computer technology has led to some improvements, but not enough to drastically improve the customer experience.\n\n## The Risks & Costs Of Using Contact Centers For Patient Management\n\n### High Costs\n\nIf you want to establish a call center as a touchpoint, you can either establish one in-house or outsource it. You'll be tasked with paying salaries, overhead, and initial setup costs in both cases. Call centers are not plug-and-play, so you'll need to recruit, train, and onboard customer support agents, which can take weeks. You'll pour valuable resources into the process well before taking a single call.\n\nAccording to [Glassdoor](https://www.glassdoor.com/Salaries/us-customer-service-representative-salary-SRCH_IL.0,2_IN1_KO3,34.htm), the average customer service representative in the United States earns $49,116 per year while [customer service managers](https://www.glassdoor.com/Salaries/us-customer-service-manager-salary-SRCH_IL.0,2_IN1_KO3,27.htm) make $68,703 each year plus benefits. For a team of five (four agents and one manager), you’ll spend about $265,167 each year on salaries alone. Outsourcing call centers can reduce some of those costs, but they are still far from cheap, running from [$25/hour-$65/hour](https://www.cloudtask.com/blog/how-much-does-it-cost-to-outsource-a-call-center#:~:text=If%20you%20look%20around%20the,week%20or%20%24349%2C440%20per%20year.) per call center representative.\n\nThe roadblocks don't end when your team is set up. Agent turnover is a persistent issue at call centers and maintaining regular staffing numbers can be a challenge. Individuals are less inclined to stay in call center jobs if there are limited learning opportunities, unfavorable work cultures, low wage increases, and other factors beyond management's control, like more attractive job offers. To build a dedicated staff, you'll have to ensure that employees feel fulfilled in their roles and spend money on the kinds of benefits that compel them to stay. Every time you lose an agent, you'll need to go through the recruitment and training process or suffer the consequences of reduced staff.\n\n### Human Error\n\nCall centers require a significant amount of oversight to ensure quality day-in, day-out. If the call center agent is having a bad day or hasn't taken the time to read their training manuals, callers will receive subpar service that can taint the way they view your practice.\n\nOutsourced call center agents are often assigned calls for multiple practices. Therefore, their time and attention may be divided throughout the workday. They may never have time to focus solely on your practice or become as passionate about your vision as your core team. When prospects call customer service, they want to speak with a sympathetic listener who knows how to answer their questions. They'll notice distracted agents right away.\n\nAnother concern that’s frequently overlooked is security. The standards for background checks differ between countries and states and may even change from company to company. Depending on who you choose to work with, confidential or sensitive information may be left unsecured. In real estate, that can include credit checks, tax returns, sensitive bank information, and more. Security breaches can lead to expensive legal battles and, even worse, cost you client trust.\n\n### Outdated Tech and Performance Measurements\n\nMany call centers run on outdated technology. Those built before the digital revolution often lack the tools necessary to support modern patient engagement. That can mean longer wait times in the absence of automated menu options or voice commands. A lack of automated triaging can result in people being shuffled around a phone tree.\n\nWhile call center technology remains mired in the past, patients are not leaving their consumer expectations behind when they interact with their doctor. They expect the same level of service, ease, and accessibility that they receive everywhere else. [68% of patients](https://www.patientpop.com/blog/patient-experience-stats/) would prefer a provider that enables them to book, change, or cancel appointments online while 69% of patients are more likely to choose providers that communicate with patients via email. [70% of patients](https://www.patientpop.com/blog/patient-experience-stats/) would choose a provider that sends emails or texts when it’s time for follow-up or preventative care and 57% expect automated text, voice, or email reminders for appointments.\n\n### Conversational AI as an Alternative\n\n[Conversational AI overcomes the limitations of conventional call centers.](https://www.eliseai.com/healthai) Advanced artificial intelligence can scale to meet any call volume, ensuring that patients always receive answers promptly and efficiently. Unlike call center agents, AI doesn’t have bad days or bad moods. It never sleeps, never clocks out, and never changes jobs. This dramatically increases reliability, consistency, and reduces internal friction.\n\nBut automation does not mean that you have to sacrifice quality in the interaction. Advanced artificial intelligence can handle a wide range of inquiries and requests. Tools like EliseAI’s VoiceAI can meet customers in the channel that they prefer and provide humanlike conversational back-and-forth. An additional benefit of conversational AI is that it collects information from its interactions to improve over time.\n\nNot all customer inquiries require the same amount of attention. AI makes sense of simple questions and answers them quickly, allowing your team to deal with more complex ones. Conversational AI can also handle multiple requests at once, ensuring that everyone's needs are met, and you reserve your team’s energy for where it is applied best."
}