{
    "title": "How EliseCollect Modernized Collections For Cardinal Group Management",
    "author": "Rebecca Kravitz",
    "date": "April 4, 2023",
    "summary": "The article discusses how EliseCollect has transformed the collections process for Cardinal Group Management, enhancing efficiency and reducing delinquencies through advanced AI solutions.",
    "main_content": "# How EliseCollect Modernized Collections For The Cardinal Group\n\nAs the world continues to evolve, the property management industry is experiencing a significant shift in the way it operates. With technological advancements and changing consumer demands, companies must stay ahead of the curve to remain competitive.\n\nOne such company that is leading the way in forward-thinking property management operations is Cardinal Group Companies. They recognize the importance of leveraging new technologies to streamline their operations, enhance their services, and deliver exceptional experiences to their customers.\n\nFrom using artificial intelligence to rewriting the playbook on property management, [Cardinal Group](https://cardinalgroup.com/) is committed to adopting innovative solutions that improve the efficiency, sustainability, and profitability of their business and clients.\n\n### How EliseCollect Modernized Collections For The Cardinal Group\n\nThe financial health of property management often crucially depends on their rental income, which has been heavily impacted during the pandemic. As owners and operators attempt to reduce and mitigate bad debt, traditional methods of rent collection are only stalling their efforts. Monthly, they rely on leasing and collection teams to chase payments, which can be time-consuming and ineffectual. With 20% of residents wanting assistance making rent payments, there are not enough hours in a day or night for leasing teams to manually manage community collections.\n\nHowever, with the advancements in artificial intelligence, rent collection can now be more streamlined and efficient, resulting in fewer delinquencies and less bad debt. New from EliseAI: EliseCollect, the most advanced AI assistant for payments and collections.\n\nCardinal Group was integral to the creation of [EliseCollect](https://www.meetelise.com/products/elisecollect). With EliseCollect automating payments across strategic assets, they were able to expedite their cash flow, save time, and ensure on-time payments, with new workflows established in less than a month.\n\n### Four Ways That Cardinal Group Uses EliseCollect For Total Collection Automation\n\n#### 1. Automating 90% Of All Payment Messaging\n\nOne of the most significant benefits of EliseCollect is the ability to automate all rent messaging, including reminders, instructions, and responses to payment questions via text as the primary, email and calls. EliseCollect sends automatic, personalized messages to residents when rent is overdue for their specific unit, eliminating the need for leasing teams to reach out.\n\n#### 2. Accelerating Payments By 10 days on avg.\n\nRoutine reminders, that are personalized and price-specific, reduce the likelihood of late payments. Cardinal Group rolled out EliseCollect across multiple properties at once, reporting positive results on hastening cashflow with more on-time payments.\n\n> “Communities began implementing Elise Collect on March 1st and today, March 10th, one community is showing 1% outstanding A/R. Over the past 5 months, the earliest the team has hit this mark was in February on the 21st day.”  **Shane Guillot | Director, Centralized Operations | Cardinal Group Management**\n\n#### 3. Reducing Delinquencies By 40% And Freeing Up Team Time\n\nFor centralized teams, like those at Cardinal, the old-school collection isn’t effective, with team members each overseeing rent payments for multiple communities. EliseCollect increases efficiency with AI that can triage communications, track and log payments, and identify routine and old delinquencies across all communities.\n\n> “EliseCollect has contributed immensely to the velocity of collections, allowing onsite team members to focus on larger, older balances.” **Shane Guillot | Director, Centralized Operations | Cardinal Group Management**\n\n#### 4. Producing Customized Collection Reports and Analytics\n\nEliseCollect’s AI-powered rent collection provides property management with customized reports and analytics. EliseCollect is connected directly to Cardinal Group’s CRM, so that data lives in one location for their team to review. This feature allows them to see rent paid on time, identify late payments, and generate reports on rental income for all stakeholders. This data can be used to make informed operational decisions about rent pricing, resident screening, and property management.\n\n> “EliseAI improves our rent collection process by increasing the speed of payment collection and facilitating centralization of our processes, thereby enhancing efficiency.” **Jacob Kosior | VP of Centralization | Cardinal Group Management**\n\nFor Cardinal Group, EliseCollect is absolutely crucial to its success and enables them to have a unique people-first approach to centralization. They use [EliseAI’s tools](https://www.meetelise.com/) to empower teams and refocus property management so that the residents, prospects, and their people have a more positive Cardinal experience.\n\n### [Download The Case Study Now](https://me.meetelise.com/Cardinal-Group-EliseCollect)"
}