{
    "title": "Introducing EliseAI's Fee Transparency Suite",
    "author": "Clay Walsh",
    "date": "February 18, 2025",
    "summary": "EliseAI announces its new Fee Transparency Suite designed to help property management operators manage regulatory compliance and enhance fee transparency for prospective residents.",
    "main_content": "# Introducing the EliseAI Fee Transparency Suite\n\nRental housing providers are under growing regulatory scrutiny over the clarity of fees and charges they present to prospective residents. Recent enforcement actions, class action lawsuits, and state-specific regulations have emphasized the importance of transparent and upfront fee disclosures.\n\nAt EliseAI, we build solutions that equip owners and operators with the tools to help manage changing standards and expectations around fee transparency and compliance. With that in mind, we’re excited to announce our new **Fee Transparency Suite**, a collection of product enhancements and new features designed to support operators as they enact their compliance management strategies from the beginning of the resident journey.\n\n## Why Fee Transparency Matters More Than Ever\n\n### Evolving Legal and Regulatory Landscape\n\nRecent federal enforcement activity, class action lawsuits, and state-level regulations underscore the importance of comprehensive, easily accessible fee disclosures for operators across the multifamily, single family, student, and affordable sectors. Changing regulatory conditions and an increased focus on transparent pricing place pressure on property management companies to remain compliant, maintain the trust they’ve built with their residents, and protect their reputation and brand.\n\n### Enhancing Resident Relationships\n\nNo consumer likes to feel misled when they go to make a purchase, and it’s no different in the multifamily space. We regularly hear from prospects and residents that hidden or surprise fees are a leading cause for controllable move-outs. By putting fees front and center, operators can not only bolster their compliance efforts, but also eliminate confusion, build trust with residents early on, and drive positive leasing experiences and higher resident retention rates.\n\n## What’s Included in the Fee Transparency Suite\n\nOur new fee transparency suite is built to enable operators to break down and display their fees in different ways across different parts of the resident journey, giving PMCs options and flexibility as they consider their approach to compliance across their portfolio.\n\n### Centralized Fee Management\n\nAt the heart of our suite is the **Centralized Fee Management** system within EliseCRM. This new settings page gives you a single location to configure all your fee disclosures, ranging from application fees to monthly add-ons to pet charges and more. Once set, these fees automatically sync in a variety of locations, including:\n\n- **Conversations:** Whenever a lead or resident asks about pricing, EliseAI will draw from the most current fee data.\n- **Quotes:** Any quote generated for a prospect will include the applicable fees as indicated by the operator.\n- **Applications:** Applicants see an itemized breakdown of costs right in their online application workflow.\n- **UI Elements:** Any dynamic UI EliseAI generates for leads, like on property website widgets, will pull fee information from the centralized settings page.\n\nEliseAI uses existing property information when possible while also pulling information from existing property management system (PMS) integrations. Whenever you update a fee in the EliseAI platform, it automatically propagates to your entire portfolio.\n\n### Smart Disclosure System\n\nComplying with the evolving pricing transparency landscape can be challenging, especially for property operators with portfolios across multiple states. Our **Smart Disclosure System** helps property managers implement their fee disclosures strategy by:\n\n- **Automating Fee Disclosures:** Pricing discussions can automatically include fee breakdowns, triggered at relevant conversation moments selected by the operator.\n- **Configurable State-Specific Requirement Logic:** EliseAI’s Fee Transparency Suite gives operators configurable options to tailor their disclosures to meet local rules.\n- **Embedded Disclaimers and Notifications:** From initial inquiry to lease signing, EliseAI provides operators with tools to embed desired disclaimers and notifications at the right stages of the resident journey, without requiring manual intervention from onsite or corporate teams.\n\n### Multiple UI Transparency Tools\n\nFee transparency isn’t only about supporting compliance efforts. It’s just as much about delivering a positive, trustworthy renter experience. That’s why our Fee Transparency Suite offers various ways to share fee information with prospects. Our **Estimated Total Cost Disclosure** surfaces monthly fees and one-time fees to prospects on a dynamic and customizable webchat widget.\n\nEliseAI’s **Fee Guide Webpages** also offer operators completely customizable pages that can either be embedded directly on a community website or hosted by EliseAI. Operators can configure and customize these pages to provide a comprehensive breakdown of recurring fees (like rent and monthly pet fees) and one-time fees (like application or move-in fees). EliseAI can also generate **PDF Fee Guides**, aggregating all relevant operator-provided fee information in an easily digestible PDF format. From initial lead interactions to final leasing negotiations, these PDFs can be shared at any stage, helping the conversation around fees stay transparent, traceable, and easily accessible.\n\n## Key Benefits of EliseAI’s Fee Transparency Suite\n\nThere are several key process improvements operators should expect to see when utilizing the EliseAI Fee Transparency Suite. For one, through programmable fee disclosures and up-to-date disclaimers, the Fee Transparency Suite gives operators the tools to help facilitate compliance with federal, state, and local requirements. In addition, operators can use the Fee Transparency Suite to build trust with residents by providing clear, digestible cost breakdowns that eliminate guesswork or ambiguity when it comes to pricing.\n\nThe Fee Transparency Suite also cuts down on the amount of manual fee updates you have to handle, instead centralizing all fee information to one location in EliseCRM that then populates in all other fee related instances. This simplified, standardized experience reduces staff workload and minimizes the risk of human error or oversight.\n\n## Getting Started with EliseAI's Fee Transparency Suite\n\nEliseAI’s new Fee Transparency Suite is designed to give operators flexibility and customizable options they can use to facilitate their response to the evolving pricing transparency compliance landscape, protect their reputation, and create a more transparent and equitable leasing experience for all their residents. If you’re already an EliseAI user, keep an eye out for early access announcements—your account representative will provide details on how to get started with the Fee Transparency Suite. If you’re not an EliseAI customer but are interested in learning more about EliseAI’s full suite of AI and automation solutions, get in touch with us today."
}