{
    "title": "Multifamily Leader Jacob Kosior Joins EliseAI Executive Team",
    "author": "Arianna Paranzino",
    "date": "August 19, 2024",
    "summary": "EliseAI announces the addition of Jacob Kosior to its executive team as Vice President of Client Strategy, bringing over a decade of multifamily housing experience.",
    "main_content": "# EliseAI Adds Seasoned Multifamily Leader Jacob Kosior to Executive Team\n\nFollowing its $75 million Series D fundraise, [EliseAI](https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.eliseai.com%2F&esheet=54110225&newsitemid=20240819776651&lan=en-US&anchor=EliseAI&index=1&md5=84cd141aaf7131bf3bc8c28465c841f9) has added seasoned multifamily executive Jacob Kosior to its leadership team as Vice President of Client Strategy.\n\nJacob has over ten years of experience in the multifamily housing industry, spanning operations, marketing, and centralization efforts across conventional, student housing, affordable housing, and build-to-rent communities.\n\n“I’m excited to join the EliseAI team at this pivotal moment in the multifamily housing industry. As operational dynamics shift and AI becomes increasingly integral to management operations, I’m thrilled to work with the forward-thinking team driving this transformation,” said Jacob. “Together, we’ll redefine industry standards and create innovative solutions that will shape the future of housing for years to come.”\n\nJacob will be responsible for leveraging his deep industry experience to help EliseAI continue innovating and building the best products for multifamily owners and operators.\n\nMinna Song, EliseAI’s CEO and Co-Founder, stated, “We are thrilled to welcome Jacob to our leadership team. With over a decade of experience across various facets of the multifamily housing industry, Jacob brings a wealth of knowledge that will be invaluable as we continue to advance and develop best-in-class AI products. His leadership and expertise will play a pivotal role in driving our mission forward and ensuring that EliseAI remains at the forefront of multifamily industry innovation.”\n\nJacob most recently served as the Vice President of Centralized Services at Cardinal Group Management and has previously held leadership positions with BH Management, The Dinerstein Companies, and CA Ventures. He holds a B.A. from Princeton University and a Master's in Urban Planning & Policy from the University of Illinois at Chicago."
}