{
    "title": "SFR in 2024: A Year of Operational Efficiency & Resident Experience",
    "author": "David Berardi",
    "date": "December 8, 2023",
    "summary": "The article discusses the anticipated focus on operational efficiencies and enhancing resident experience in the single-family rental market for 2024 amidst changing economic conditions.",
    "main_content": "# Introduction\n\nOn Dec. 4 2023, the EliseAI team headed to [IMN’s Single Family Rental Forum](https://events.imn.org/event/a60756bc-5600-48e9-bc0a-1d6bba4f8c54/summary) to talk to industry thought leaders, technology evangelists, and property owners about the single family rental market.\n\nIt's no secret that for the past 8–10 years, single-family rentals have been one of the hottest asset classes in any real estate sector. They provide a longer-term tenant base, more room for those who are fleeing crowded cities, and consistent rent growth. The mass exodus of renters from crowded cities to suburbs fueled by COVID only created more demand for single family rentals.\n\nIn 2023, the SFR market finds itself in a pretty unusual position. High-interest rates have relegated any would-be homebuyers to renting, which should create a demand surge for SFR. At the same time, large single-family investors also cannot buy homes and are struggling with rising insurance costs & delinquency rates.\n\nOwners and operators have to reassess their operations to ensure they are running as lean and efficiently as possible. Resident experience is also at the forefront of their minds, and we’re seeing more operators offer amenities seen traditionally in the multifamily space. In this blog, I’ll discuss why 2024 will be the year of enhancing operational efficiencies & modernizing resident experience, while acquisitions are on a brief pause and [rent growth cools off](https://www.housingwire.com/articles/slowing-single-family-rental-price-growth-is-approaching-pre-pandemic-levels/).\n\n## Operational Efficiencies\n\nFrom 2019–2022, we saw [meteoric rent growth](https://www.corelogic.com/intelligence/u-s-single-family-rents-up-10-2-year-over-year-in-september/) in major markets like Charlotte, Tampa, Austin, Vegas, Nashville, etc., and single-family rentals practically rented themselves. A simple Zillow ad for a well-priced home often went for above ask, and renewal offers pushed double digits. The fight to keep up with this demand alongside extremely low-interest rates caused owners to focus on one thing only: buy or build as many homes as possible.\n\nWhile many did extremely well during this time, it caused operational improvements to stagnate. It didn’t matter if you had a bloated staff, an expensive call center, or poor branding. Owners didn’t have to respond to leads quickly or even respond to all of them.\n\nIn 2023, coming out of COVID and inflation, the tides have shifted in a major way. It is now more important than ever that operators maximize every single lead that comes in the door or reaches out online, reduce days on market, and lease in a scalable and efficient way.\n\nOwners & operators are investigating more technology to both accelerate and streamline, but also cut the bloat and even centralize operations effectively.\n\n- Self-guided touring eliminates the need for agents onsite in every market.\n- Virtual touring accelerates lead-to-lease, and offers an accessible option for renters moving.\n- Integrating software for more centralized views of data and property management enables teams to operate from anywhere.\n- AI for leasing provides a scalable way to respond to all of your top-of-funnel leads so teams can conduct tours and engage leads in person without distraction.\n\nIn 2024, it will continue to be a dog-fight for winning renters. All things being equal, renters will generally view and rent the first homes that respond to them and provide a solid experience. The operators who adopt a tech-enabled, brand-focused operations strategy towards leasing will continue to excel. The next piece of the puzzle is retention, of which resident experience is a major leading indicator.\n\n## Resident Experience\n\nWhile homes were renting like hotcakes, owners also didn’t have to provide a superior resident experience. The economy was humming, and delinquencies were not a worry.\n\nAs the market continues its shakiness, it will be important for SFR owners to foster a resident-focused brand. This is extremely common in multifamily.\n\nSome common strategies include…\n\n- **Going mobile:** According to a 2020 survey from Zillow, Millennials account for 43% of single-family home renters and 41% of multifamily housing residents, and are more open to using a mobile app for maintenance requests, lease renewal and communications with property management in general.\n- **An accessible team who is communicative:** [50% of managers regularly communicate with residents via their home phones](https://www.naahq.org/4-lessons-learned-single-family-and-multifamily-property-management). This is extra important as we think of who is now renting single-family homes — millennials who have likely left apartment community living for more space.\n- **Faster maintenance:** Owners & operators are quick to credit fast work order completion rate as a primary reason for renewal. (EliseAI now automates all resident communication, taking work orders from 40% of residents after-hours).\n- [**Cultivated resident experiences**](https://www.multifamilydive.com/news/gen-z-renters-experience-social-media-art-artistic-amenities/650185/) are especially important to Gen Z renters.\n\nIn 2024, I think we’ll see more and more rebrands into more resident-friendly, tech-enabled single-family brands. We’ll see the expectation for responses for maintenance & onsite teams get much faster, and SFR will generally start to resemble multifamily in terms of resident experience.\n\nThe boom in the single-family rental space from 2015–2023 was very important for the sector’s growth and scale but caused operations and resident experience to take a back seat. As acquisitions will likely be extremely slow for at least the next 12 months, single-family operators will use this time to optimize internally before the next big buying opportunity. We’re in the early innings for SFR, and this next phase will be impactful for so many owners and renters across the country.\n\n**You can read David Berardi’s original post plus more at [Medium.com](https://medium.com/@daber.berardi/single-family-rentals-in-2024-a-much-needed-year-of-operational-efficiencies-resident-3eb24fea129b).**"
}