{
    "title": "Takeaways from EliseAI's \"Commercialization of Centralization\" Webinar",
    "author": "Clay Walsh",
    "date": "January 16, 2025",
    "summary": "This article discusses key insights from EliseAI's webinar on the commercialization of centralized services in property management, highlighting strategies for scaling teams and revenue generation.",
    "main_content": "# Takeaways from Part Five of EliseAI's Centralization Webinar Series, \"Commercialization of Centralization\"\n\nHigher than ever consumer expectations and a tight economic climate are driving more and more property management companies to turn to centralized operating models. The benefits are apparent, with faster response times for prospects and residents, improved job satisfaction for onsite teams, and reduced operating costs due to flexible staffing arrangements. However there’s an additional upside to centralization that many operators don’t take into account: opportunities for commercialization of centralized services.\n\nJacob Kosior, VP of Client Strategy at EliseAI, has extensive experience scaling commercially successful centralized teams. During his time at BH Management and the Cardinal Group, Jacob leveraged AI-driven tools and specialized teams to increase operational efficiency while opening new revenue streams for the operators. With that in mind Jacob recently hosted a webinar, “Commercialization of Centralization”, where he covered tactical steps such as strategies for scaling a centralized team, cost modeling, and bill rate calculations—here are key takeaways from that session.\n\n## Scaling Centralized Support Teams\n\nWe’ve recently covered steps for standing up [centralized leasing](https://www.eliseai.com/blog/takeaways-from-part-three-of-eliseais-centralization-webinar-series-centralized-leasing) and centralized resident services functions, sharing tips for how to best build out these teams. One foundational part of the process is defining which tasks will be centralized and which tasks remain on site. Certain specialized tasks, like rent collection and financial move-outs, may require dedicated resources, while other roles like leasing or call handling often benefit from a team-based approach. It’s also important to consider the ratio of communities to centralized staff in order to ensure you find the sweet spot for how much work your centralized teams can handle. This ratio generally depends on factors like scope of tasks, property type (e.g., student housing vs. market rate), and lead volume. In general, [AI assistants](https://www.eliseai.com/blog/multifamily-chatbots-vs-multifamily-ai-assistants) can automate 80–95% of prospect and resident conversations, enabling centralized staff to handle more communities than you might otherwise expect.\n\nIt’s also important to realize that not all centralized teams look exactly alike. In some cases, a dedicated offsite specialist is assigned to specific high-value communities to develop deeper familiarity and ensure consistency in communications. In other cases, a pooled, team-based approach can effectively manage a high volume of tasks for multiple assets, ensuring no single property overwhelms the pipeline. Specific community and portfolio considerations should be taken into account in these cases to ensure you find the right model for your assets.\n\n## Billing Centralized Services\n\nCertain operators have been able to effectively commercialize their centralized offerings to ownership groups through extensive ROI calculation and the establishment of fair bill rates. But before you dive right into establishing bill rates or fee structures, it’s pivotal to calculate the “all-in” cost of each centralized employee. This includes salary, benefits, bonuses, corporate overhead, hardware/software expenses, and the cost of specialized AI technology that allows centralized teams to work at scale. Once you have these “all-in” costs you can look to build a fee structure that effectively allows you to commercialize the work these teams are handling.\n\nBy multiplying the number of units covered by a centralized team member, managers can test various per-unit monthly fees. Adjusting parameters—such as having a team member support five vs. six properties—can reveal how to lower the per-unit fee while still maintaining profitability. Once total costs are identified, communities can be billed according to an agreed-upon structure. Options include per-unit monthly fees, flat fees, or hybrid approaches. The use of AI assistants lowers the necessary bill-back rates by allowing your staff to scale beyond their normal working capacity. Having AI automate at least 80% of your prospect and resident communications greatly increases your centralized team’s bandwidth to handle other tasks, improving your ROI and enabling you to strategically adjust bill rates.\n\n## ROI and Cost Considerations of Centralized Teams\n\nEvaluating the total cost of a dedicated onsite assistant manager against the cost of a centralized specialist can show significant savings—often 40% or more per year. This payroll reduction also significantly improves staffing resilience, as it’s easier to add or shift centralized team members than to backfill onsite vacancies due to geographic considerations. Beyond reduction of staffing costs, implementing centralized call handling, AI solutions, and remote collections tools can eliminate the need for pricey third-party services.\n\nOffering centralized services as part of property management not only benefits clients, but can also generate an internal revenue margin. The resulting cap rate impact from reducing operating expenses can significantly increase overall property valuations, which is particularly relevant in the context of acquisitions.\n\n## Leveraging Advanced Tools and Tech for Commercialized Centralization\n\nUtilizing AI and automation technology acts as a force multiplier that enables operators to make a margin on their centralized services. [Delinquency automation tools](https://www.eliseai.com/resources/delinquency?_gl=1*p4aoec*_gcl_au*MTUzNTcxMTgxMy4xNzMwNzMyNDkz), [text-based maintenance support](https://www.eliseai.com/resources/maintenance?_gl=1*lbajag*_gcl_au*MTUzNTcxMTgxMy4xNzMwNzMyNDkz), and AI-driven outbound calls all expand a single team member’s capacity, allowing them to perform work that traditionally would’ve been handled by multiple agents. This, in turn, gives PMCs an opportunity to improve their margins and bill commercialized services back to ownership groups.\n\nAI doesn’t eliminate the need for offsite team members, however. High-stakes or complex questions may still require human intervention. AI tools and automations excel in handling repetitive or straightforward tasks, ensuring timely service for prospects and residents without sacrificing empathy or subject-matter expertise in challenging situations.\n\nImplementing [advanced voice routing platforms](https://www.eliseai.com/resources/call-center?_gl=1*lbajag*_gcl_au*MTUzNTcxMTgxMy4xNzMwNzMyNDkz) to direct calls to the right centralized or on-site agent cuts down on the need for IVR and lengthy hold times. This in turn reduces reliance on costly after hours call answering services and call centers. In addition, the fact AI can constantly refer to a shared knowledge base—updated with property-specific info—further reduces the human workload for repetitive inquiries and ensures all prospects and residents get accurate answers over the phone.\n\n## Overcoming Implementation Challenges\n\nAdopting a centralized model comes with significant organizational changes, including the need to redefine roles to better fit the new operating model. Managing the anxieties of team members over this role rescoping and the uncertainty that comes with a large change is a key part of effectively implementing a centralized model. It’s crucial to emphasize to your team members that newly specialized positions can offer new opportunities for career growth and mitigate onsite burnout in order to increase buy-in. Rather than the traditional site-based career trajectory, employees can specialize in leasing, delinquency management, or resident services while working across multiple communities, offering fresh avenues for advancement. Involving site teams in planning can increase acceptance of the new way of working, and minimize any resident concerns about reduced service quality.\n\nEmphasizing to team members that handling student, affordable, and market-rate communities simultaneously will broaden their skill sets can also help increase buy-in. And with AI knowledge banks storing specialized property details, it’s easier than ever for centralized teams to manage a variety of asset types across a portfolio.\n\nCentralized, AI-supported teams should be measured based on KPIs centering around increased responsiveness, decreased delinquency rates, and improved resident satisfaction. Building regular feedback loops—such as surveys to onsite staff and residents—keeps your operators transparent and enables continuous improvement and fine tuning. In general, Jacob found that most residents do not require extensive explanations about who is handling their request provided issues are resolved promptly. However, if a shift to offsite support is noticeable, making clear announcements and ensuring consistency in your branding can help maintain trust and familiarity amongst the resident base.\n\n## Building a Centralized Model with AI Support\n\nCentralizing your property management operations can yield significant payroll savings, improve operational stability, and create new revenue streams for operators in a tight economic environment. By combining AI-driven solutions with carefully structured and specialized offsite teams, property managers have the opportunity to transform a historically cost-heavy model into one that improves operational efficiency and increased profitability. By leveraging AI technology and implementing a new working model, operators have an opportunity to improve their margins, offer new career opportunities for their team members, and deliver better experiences for their residents."
}