{
    "title": "Takeaways from Part Two of EliseAI's Centralization Webinar Series",
    "author": "Clay Walsh",
    "date": "October 18, 2024",
    "summary": "This article summarizes key insights from the second part of EliseAI's Centralization Webinar Series, focusing on role specialization in property management.",
    "main_content": "# Takeaways from Part Two of EliseAI's Centralization Webinar Series, \"Role Specialization\"\n\nMore and more property managers are experimenting with a shift to a centralized operating model, moving the responsibilities of onsite roles to offsite teams that can work effectively at scale in order to drive a positive [impact on property NOI while improving resident and prospect experiences](https://www.eliseai.com/whitepaper-5-reasons-why-property-management-companies-need-to-centralize-in-2024). However, moving roles offsite is easier said than done—dedicated offsite team members have different responsibilities and specialized skills that aren’t always a one to one match with onsite teams. So how can property management companies ensure the centralized teams they build operate efficiently and cost-effectively?\n\nJacob Kosior, Vice President of Client Services at EliseAI, dove into these topics in Part Two of EliseAI’s Centralization Series, “Role Specialization,” along with special guest [Suzanne Hopson](https://www.here2elevate.com/about), Founder and Principal at [Here2Elevate](https://www.here2elevate.com/). Between Jacob’s time leading the centralization effort at Cardinal Group Management and BH Management, and Suzanne’s 20+ years in the property management space, they have extensive experience building high-powered centralized teams at scale with help from technology including AI. Here’s six key takeaways from their discussion on specialized roles in a centralized model.\n\n## Takeaway One: Centralizing Takes Vision and a Roadmap\nEstablishing a clear and shared definition of centralization to work towards is crucial for guiding your organization’s efforts and ensuring that all stakeholders are aligned. Jacob and Suzanne shared the following definition that you can use internally to keep everyone on the same page:\n\n**“Centralization is the shifting of responsibilities and tasks that were traditionally handled by an on-site community-based team, which is now moving to an off-site specialized team with the goal of improving efficiency and experience.”**\n\nBut having a definition of centralization is only one part of the process. We also need a roadmap to follow for the process of implementing this new model.\n\n### Creating a Centralization Roadmap\nWithout a centralization roadmap it’s hard to track your efforts, identify issues and roadblocks, and report on progress to senior leadership. Here’s what a typical centralization roadmap looks like.\n\nEmbarking on a phased shift to a centralized model is important, because trying to centralize every part of your operations at once is far too chaotic. A successful centralization roadmap involves detailed planning of each step in the process to ensure a structured transition, as well as dates for the phases in order to measure expectations and keep team members aligned.\n\n## Takeaway Two: There’s More Than One “Correct” Model for Centralized Leadership Teams\nThe structure of your centralized services leadership team will impact the speed, scope, and comprehensiveness of your centralization rollout. While there’s no “one-size-fits-all” approach for leadership team structure, there are a few different models that cover most use cases.\n\n### Model A: Operations-Driven Team\nIn an operations-driven model, the operations leadership takes charge of implementing centralization while also managing the day-to-day operations of the communities. For ops teams with strong problem solving skills that are also used to change management, this model could be a great fit. However, operations teams may already be low on bandwidth, and may be less receptive to using technology to fix issues.\n\n**Pros:**\n- Deep understanding of existing challenges and needs within operations for targeted solutions\n- Direct control over deployments and new roles to drive alignment\n- Aware of client and partner demands to help manage relationships\n- Single PoC simplifies communication with tech partners and other stakeholders\n\n**Cons:**\n- Balancing daily operations with planning can cause slow progress due to bandwidth\n- Limited opportunities for novel ideas, as the focus remains on immediate concerns\n- Potential for resistance to adopting new technologies due to familiarity bias\n\n### Model B: Cross-Departmental Support\nIn a cross-departmental model different teams are responsible for various facets of centralization, each contributing their inputs to the overall effort. This approach allows you to tap into a variety of different skill sets and areas of expertise, but runs the risk of slowing progress due to communication breakdowns and departmental silos.\n\n**Pros:**\n- Specialized department expertise ensures centralization efforts are informed by deep knowledge\n- Familiarity with department-specific tech facilitates smoother technology integration\n- High level of quality control with direct change management oversight\n\n**Cons:**\n- Coordination across departments can present challenges\n- Risk of creating technological silos\n- Absence of a centralization roadmap may result in inconsistent strategies and objectives\n\n### Model C: Dedicated Department\nSome organizations may consider standing up a new department focused solely on driving the centralization initiative forward. Having dedicated resources for the centralization push can lead to expedited timelines and a strong sense of focus, but adds new layers of complexity to existing organizational structures.\n\n**Pros:**\n- Dedicated centralization resources can lead to faster implementation\n- Potential for innovative ideas without existing departmental constraints\n- Focused team can drive enhanced communication and coordination with external partners and internal stakeholders\n\n**Cons:**\n- New department adds complexity to change management\n- Potential conflicts may arise with existing roles and authority\n- Risk of misalignment if centralization efforts are not integrated with organizational goals\n\n## Takeaway Three: Location Matters When Building Centralized Teams\nWhere operators choose to locate their offsite teams is a function of which roles the teams are taking on, plus geographical considerations. Jacob and Suzanne shared three common location structures for offsite teams: Regional Pods, Corporate Offices, and Fully Remote. These models are applicable to either owner-operators or third-party managers, but considerations may vary by management-type, portfolio size, and the geographic density of AUM.\n\n### Regional Pods\nCompanies with high asset concentration in specific areas may be well off using a regional pod model, leveraging existing office spaces and tapping into local talent pools to deliver services at scale with AI tools. This best of both worlds approach allows your centralized teams to support regional communities with a level of geographic proximity that can be beneficial for understanding local market nuances, while still allowing them to become specialized resources.\n\n### Corporate Offices\nCentralizing roles at the corporate level offers onsite team members new career paths and opportunities for advancement within the organization. It can help foster a cohesive corporate culture, and streamlines communication between centralized teams and executive leadership. However, centralization at the corporate level does potentially limit your talent pool to the geographic location near the office.\n\n### Fully Remote Options\nImplementing fully remote centralized teams expands your talent pool significantly, allowing you to attract high-performing candidates who value flexibility. Remote work options can also improve employee satisfaction and retention by accommodating those with diverse work preferences, particularly for underrepresented segments like working parents or people with disabilities. However, fully remote centralization does require an increased need for oversight and quality control due to the dispersed nature of the team.\n\n## Takeaway Four: There Are More Organizational Considerations Than You Think\nBeyond basic considerations about the new operating model like location and responsibilities there’s a variety of other organizational factors that shouldn’t be overlooked. \n\n### Technology Integration and Data Management\nOrganizations must prioritize which processes to automate in order to effectively streamline operations. A large part of that is bringing on AI tools to help teams work at scale, so it’s important to ensure new tools seamlessly integrate with existing systems. [Read more about implementing AI successfully here](https://www.eliseai.com/blog/implementing-ai-into-your-onsite-operations).\n\nRobust data collection and tracking is also key when centralizing, enabling your teams to effectively monitor progress and improve their decision-making. That means it’s key to have [a CRM designed with a centralized model in mind](https://www.eliseai.com/blog/what-to-look-for-in-a-multifamily-crm-when-centralizing-your-property-management-model).\n\n### Staff Training and Specialization\nImplementing specialized training programs for both staff and residents ensures that everyone can effectively use the new technology you’ve put in place to enable the centralization push. \n\nTailored training can help build proficiency and confidence among employees, enhancing overall productivity and reducing apprehension about the shift.\n\n### Resident Experience\nThe implementation of a new working model and AI technology can have a significant impact on the resident experience at your properties. You need to maintain clear and effective communication channels to keep residents informed. Training residents on how to interact with new technologies can improve their satisfaction and engagement with the community.\n\n### Resource Allocation\nBurnout and change fatigue are a very real obstacle facing operators transitioning to a centralized model. It’s important to efficiently allocate support teams and resources to handle the demands of centralization without overburdening staff.\n\n### Risk Management and Compliance\nBringing in new technology and processes opens up a can of compliance and risk-related worms. Any sensitive information that is now being digitized presents a risk of breaches that could cause either significant reputational or financial consequences, making it important to both implement strategies to mitigate digital risks and to adhere to protocols around data storage and compliance.\n\n## Takeaway Five: Use Best Practices Management Strategies to Define New Roles\nTrying to delineate what team is going to be in charge of what without any sort of structured template or strategy for breaking up responsibilities leads to confusion. Jacob and Suzanne shared a three-step approach for role specialization and delineation that you can follow when deciding what work lives with what team during the centralization effort.\n\n### Step One: Compiling Existing Job Descriptions\nReviewing existing job descriptions allows you to identify overlaps and redundancies in your current operations, uncovering opportunities for specialization. Having all your teams’ responsibilities down on paper can give you context when creating more focused and efficient roles within the centralized model.\n\n### Step Two: Engage On-Site Team Members\nJust because a job is written one way on paper doesn’t mean that is what the job actually consists of, something most veterans of the property management industry know all too well. Conducting focus groups with onsite staff can provide valuable insights into the way daily tasks and challenges are actually handled, informing which tasks could be centralized. Plus, involving your team members in the process fosters buy-in.\n\n### Step Three: Build RACI Charts\nEquipped with both a high-level overview of who is responsible for what and a ground-level understanding of how your communities actually function, you should be able to map out a Responsibilities, Accountabilities, Consultations, and Who Needs to be Informed (RACI) chart for each key task of your onsite teams. RACI charts can provide clear insights into who handles what, as well as serving as a visual tool to ensure everyone understands their specific duties and how they fit into the larger process. Separating tasks from existing roles also allows you to map them to new centralized roles, as well as providing clarity over which responsibilities can and can’t be moved offsite.\n\n## Takeaway Six: Put the Right People in the Right Seats\n*\"Even if you have achieved all your centralization goals, they will not be sustainable without the right people doing the work. For too long we have forced people to be good at something they’re not, or given them responsibilities that are not in their zone of expertise and fulfillment. If you carefully craft roles and match the right person with the innate traits to those roles, you will create direct and positive impact on your organization.\"*\n\n-Suzanne Hopson, [Founder/Principal at Here2Elevate](https://www.here2elevate.com/about)\n\nIn general, people are more willing to work hard when doing things they’re passionate about. When centralizing your operations, matching team members’ innate skills and preferences with suitable roles tends to boost both their job satisfaction and performance, in turn delivering better outcomes for both the employee and the organization. That means understanding what employees are passionate about and excel in is more than just a nice to have—it’s a key component of the centralization process. But that’s easier said than done. How can you, as Suzanne said, make sure you put the right people in the right seats while moving roles offsite?\n\n### Understand Your Employees’ Preferences\nIdentifying the tasks that employees enjoy and are proficient in helps you avoid placing them in roles that don’t align with their strengths, reducing turnover rates and increasing engagement.\n\nConducting thorough screening during the centralization push to get a better understanding helps ensure that the right people are selected for specialized roles, enhancing overall team effectiveness. Asking questions around working styles, preferred and disliked responsibilities, and career goals can help you ascertain who is the right fit for what as you restructure your teams.\n\n### Recognizing Salespeople vs. Managers\nTrying to take a high performing leasing agent and transitioning them to a managerial role can be a quick way to lose a top team member. Just because someone is great at convincing prospects to lease an apartment doesn’t mean they’ll be a great motivator for team members who report to them. It’s important to recognize that salespeople and managers possess very different skill sets. While sales roles require high sociability and persistence, managerial roles lean heavier into strategic thinking and leadership abilities. Discerning your valuable individual contributors from your team members who thrive on helping others succeed is a key component of making sure people end up where they’re supposed to be.\n\n### Implementing the “Who, Not How” Philosophy\nSuzanne brought up the “Who, Not How” philosophy to emphasize that finding the right people to accomplish tasks rather than focusing solely on how to do them internally is the most effective way to solve problems. This approach encourages leveraging the strengths of others, whether within the organization or through external partnerships, to achieve goals more efficiently.\n\nIt is also particularly relevant in the context of technology adoption, as solutions like AI may require additional resources but can outperform internal alternatives like relying exclusively on existing staff.\n\n### Measuring the Results\nPutting the right people in the right seats also requires constant feedback to make sure they’re in fact the right people. Establishing two to three core KPIs for each role provides clear performance targets and simplifies performance tracking. Having crystal clear metrics also benefits employees, as they can clearly understand how their success is defined and how they contribute to organizational goals.\n\nFor leasing specialists, KPIs might include the number of leases signed per month or the conversion rate of leads to leases. For resident services specialists, KPIs could focus on response times to resident inquiries or resident satisfaction scores.\n\n## Embracing the Property Management Model of the Future\nRole specialization is a key component of a successful centralization push. While different models for structuring both your leadership and offsite teams have different strengths and weaknesses, they all allow you to refine the direct scope of work of your centralized teams and get a very clear picture of exactly who is responsible for what in this new way of working. The shift to centralized operations might cause friction at points, but sticking to a good plan, using RACI charts to delineate responsibilities, and leaning into your team members’ greatest strengths can go a long way towards making the change as smooth as possible.\n\nMake sure to join us for the [remaining sessions of our Centralization Webinar Series](https://hubs.la/Q02TPQ970), and stay tuned to our blog for more actionable insights and [takeaways](https://www.eliseai.com/blog/implementing-ai-webinar-takeaways) about centralization, AI implementation, multifamily technology adoption, and more."
}