{
    "title": "Takeaways from Part One of EliseAI’s Centralization Webinar Series",
    "author": "Clay Walsh",
    "date": "October 4, 2024",
    "summary": "This article summarizes key takeaways from the first part of EliseAI's Centralization Webinar Series, focusing on how to effectively implement AI into onsite operations.",
    "main_content": "# Takeaways from Part One of EliseAI’s Centralization Webinar Series\n\nArtificial Intelligence is changing the way the property management industry operates by automating manual tasks and reducing operational inefficiencies. Integrating AI into onsite operations allows property managers to focus on the human elements of the job, like delivering excellent in-person experiences, while simultaneously driving higher community NOI by accelerating renewal velocity, reducing bad debt, and increasing lead-to-lease percentages. Sounds great, right? But just like any new technology, choosing the right AI and implementing it effectively requires a good playbook and change management best practices.\n\n**Jacob Kosior**, Vice President of Client Services at EliseAI, kicked off our Centralization Webinar Series with a lesson on “Implementing AI Into Your Onsite Operations.” As the former Vice President of Centralized Services at Cardinal Group Management, Jacob has firsthand experience in implementing AI tools to improve onsite operations. Here’s 6 key takeaways from what he covered at the webinar.\n\n## Takeaway One: Define Your Company's Stance on AI\n\nIt’s hard to effectively utilize a new technology if your company doesn’t have an official stance on it to guide acceptable usage and encourage adoption. Not having an explicit AI policy can leave team members uncertain of whether or not they are allowed to use the technology, particularly when it comes to matters like data security and privacy rights. Unfortunately, property management operators not having a policy on AI usage was something we heard from many of our webinar attendees, with over 65% reporting that their company had no formal policy for the usage of AI in their operations.\n\nWith that lack of clarity in mind, how does Jacob recommend laying out a policy to govern AI usage?  \n**Step One: Be Clear and Direct with Your Team**  \nOperators should clearly and explicitly define and communicate their stance on AI to their teams. By being direct and straightforward, companies can address any misconceptions and set accurate expectations about how AI will enhance their workflows.\n\n**Step Two: Reinforce the Message at All Levels**  \nYour policy on AI usage has to be crystal clear. It’s key to outline what data can and shouldn’t be inputted into AI platforms, whether it’s acceptable or not to use AI software on company devices, and what the company’s policy is on reimbursing AI costs for workplace usage. Ensure your messaging about AI adoption is consistent and reiterated at all levels of the organization. Regular company-wide meetings and communications can help keep everyone aligned and on the same page about the benefits and implementation strategies of AI.\n\n**Step Three: Frame AI as a Means of Upskilling**  \nAI can cause concern about potential headcount reduction amongst property management teams. Instead, Jacob recommends framing AI as a means of upskilling to alleviate fears and resistance among team members. By highlighting how AI can enhance employees' capabilities and offer opportunities for professional growth, organizations can foster a more positive reception to new technologies.\n\n**Step Four: Encourage Curiosity and Engagement**  \nEncouraging curiosity and open discussions about AI can help demystify the technology and promote engagement. Providing resources, training, and support for team members interested in learning more can facilitate smoother adoption and integration. One way Jacob did this at Cardinal was by holding an open competition to name their AI agent, both humanizing the tool and creating a fun, gamified way to get staff thinking about the AI.\n\n## Takeaway Two: Identify Specific Challenges That AI Can Solve\n\nIt’s easier to prove value and measure success when you have clear challenges to solve with AI. Consider some of the following key challenges that AI can make an immediate impact on when implementing AI into your onsite operations:\n\n### Slow Response Times\nAI can significantly improve responsiveness by enabling 24/7 communication across phone, email, webchat and text. This reduces response times to inquiries and requests, ensuring prospects and residents receive immediate assistance regardless of office hours.\n\n### Inconsistent Responses\nBy standardizing responses to common questions, AI helps ensure that all customers receive consistent and accurate information. This consistency mitigates risks related to misinformation, miscommunication, and potential non-compliance with regulations such as fair housing laws.\n\n### Low Lead Conversion Rate\nAI tools can nurture leads more efficiently by automating follow-ups and maintaining consistent communication with prospects. AI is also able to personalize interactions based on previous conversations, in turn enhancing lead conversion rates and ensuring no lead gets left behind.\n\n### High Marketing Spend\nLeveraging data from AI interactions gives operators insights into which marketing channels are most effective to optimize their marketing spend, allowing them to reallocate resources to channels that yield the highest returns.\n\n### Low Collection Rates\nCollecting rent is consistently cited as one of the worst parts of the job of a property manager, making it an excellent candidate for automation with AI. AI can automate rent reminders and follow-ups with residents who have delinquent accounts, also offering residents convenient options for making payments or setting up payment plans.\n\n### Poor Maintenance Operations\nMaintenance operations can be improved by using AI to schedule work orders and provide real-time updates to residents, which can reduce turnaround times and boost overall resident satisfaction. EliseAI can even help triage maintenance requests, providing renters with clear directions over the phone to self-service minor issues like resetting a breaker or cleaning an AC filter.\n\n## Takeaway Three: Drive Stakeholder Buy-In with Data and Success Stories\nC-Suite executives may be uncertain or apprehensive about the role AI will play in the organization. It’s common to hear that they prefer to stick to tried and trusted methods of property management or they don’t believe they will see the same, let alone, increased ROI with AI. To address this, present data, case studies, and concrete examples, like [this case study](https://info.eliseai.com/hubfs/Cardinal_Centralization_CaseStudy_042424.pdf) showcasing how Jacob and Cardinal Group team utilized AI to enable their centralized teams to efficiently manage inbound leads and collections efforts at scale.\n\nAnother strategic area to showcase the ROI of AI is in tech stack consolidation. Onboarding an AI platform designed to automate the entire renter lifecycle can allow you to reduce or eliminate expensive point solutions, like VoIP platforms, experience management software, mass texting services, and call centers, allowing you to demonstrate an overall decrease in tech spend in spite of the fact you’re actually receiving wider functionality.\n\n## Takeaway 4: Fully Commit to Customizing and Improving Your AI\nHalfhearted AI adoption and implementation can result in low ROI, poor usage rates, and uncertainty about the effectiveness of the solution. When you’re implementing AI it’s important to jump in headfirst and fully commit to monitoring and improving the performance of your AI. A big part of that is [strategically positioning your AI as a new hire](https://www.eliseai.com/blog/how-to-get-the-most-out-of-your-ai-agent) to set context around the ramp up period, given that AI improves over time through experience just like a new employee would.\n\nUnlike other AI platforms that essentially “make up” new information based on what it has, conversational AI platforms for property management like EliseAI pull from a hub of information (in Elise’s case, this is called the “Knowledge Base”) and grow smarter through interacting with residents and prospects, using insights and personalized information from prior conversations to deliver customized, improved answers. With that in mind, Jacob stressed that your AI is only as good as the information you give it to pull from. Here’s what you should prioritize uploading into your AI’s Knowledge Base.\n\n### Company-Wide Policies and Procedures\nInputting company policies and standardized responses into the AI's Knowledge Base ensures that it communicates consistent and compliant information. This is especially important for topics like fair housing policies or lease terms, where miscommunicating information could result in compliance violations.\n\n### Community-Specific Information\nNo two communities in your portfolio are exactly alike, so it’s important to include property-specific information in the AI's Knowledge Base. This allows the AI to provide accurate responses tailored to each location, rather than only being able to provide general information. Specific info you should consider adding into the Knowledge Base includes updates on amenities, community policies, events, specials, parking and community-specific contact information.\n\n## Takeaway 5: Get Ahead of Common Objections\nIt’s likely that introducing new technology will ruffle feathers amongst onsite and corporate teams, as we saw when Jacob polled webinar attendees and asked what obstacles were preventing them from implementing AI. The most commonly faced issues include “our tech stack is too large, and it’s yet another tool to use” and “we have too many other initiatives at this time.”\n\nJacob recommends getting ahead of some of these objections with initial context setting and education to offset apprehension amongst your team. For example, you can look to overcome the perception that AI implementation will add to your team’s workload due to initial setup and training by emphasizing the long-term efficiency gains and time savings that will result from automating routine tasks, like how one [leading property manager reduced the amount of calls their leasing team had to handle by 41% with VoiceAI](https://info.eliseai.com/hubfs/Anon_%20Voice_CaseStudy_0424.pdf).\n\nFor teams that bristle against adding AI because they already view their tech stack as too large, AI can actually help operators consolidate their existing tech stack as discussed before. If you can demonstrate that implementing the right AI tool reduces the need for point solutions like an answering service, mass messaging tools, VoIP and an experience management platform, you can quickly begin to demonstrate ROI from tech stack reduction. You can also stress that some AI solutions like EliseAI’s tools come with [a bundled CRM platform](https://www.eliseai.com/blog/what-to-look-for-in-a-multifamily-crm-when-centralizing-your-property-management-model) that can help consolidate property management operations for the entire renter lifecycle and reduce the need for additional spend on technology.\n\n## Takeaway 6: Measure ROI and Success Metrics to Support Further AI Implementation\nAnecdotal support for AI only goes so far, so when it comes time to expand the role of AI across your portfolio it’s absolutely critical that you measure ROI and keep track of key success metrics to drive expanded adoption of AI. Jacob recommends establishing clear KPIs for AI that tightly align with the challenges identified during the planning phase. This could include metrics like reduced response times, increased lead conversion rates, increase in outstanding payments collected or improved resident satisfaction scores, so that when you go to demonstrate the value of AI you can point to concrete, measurable statistics about the performance of the new solutions.\n\nDuring Jacob’s time at Cardinal, he [measured the success of AI](https://info.eliseai.com/hubfs/Cardinal_Centralization_CaseStudy_042424.pdf) by focusing on how it supported their transition to a centralized property management model.\n\n## Don’t Miss Future EliseAI Centralization Webinars\nBy thoughtfully implementing AI into your onsite operations, you can enhance community NOI, improve customer satisfaction, and reduce strain on your team members. The insights Jacob shared on this webinar can help provide a roadmap for successfully integrating AI technologies into your property management operations.\n\nLooking for more actionable tips and strategies for centralizing your property management operations? Make sure to join Jacob and other industry experts for the rest of our Centralization Webinar Series! There’s four more sessions to come, covering everything from role specialization to centralized leasing to commercializing centralized services, and we hope you can join us. Sign up for the next sessions [here](https://www.eliseai.com/centralization-webinar)."
}