{
    "title": "Takeaways from EliseAI's \"Centralized Maintenance\" Webinar",
    "author": "Clay Walsh",
    "date": "January 17, 2025",
    "summary": "This article discusses key insights from EliseAI's webinar on Centralized Maintenance, focusing on strategies to enhance property maintenance operations through centralized functions and AI tools.",
    "main_content": "# Takeaways from Part Six of EliseAI's Centralization Webinar Series, \"Centralized Maintenance\"\n\nKeeping a community in working order is easier said than done. High technician turnover rates, fragmented maintenance processes, and inconsistent availability of maintenance data can make it difficult to anticipate and solve maintenance issues, particularly in older buildings and geographically isolated markets. Some operators have chosen to address these issues by building centralized maintenance functions, leveraging AI-powered tools and new models of working to keep their communities humming like a finely oiled machine.\n\nJacob Kosior, VP of Client Strategy at Elise AI and former VP of Centralized Services at Cardinal Group Management, has first-hand experience building out centralized teams. He brought that expertise to the table for a webinar on “Centralized Maintenance,” where he highlighted how property management companies can streamline their work order processes, improve resident satisfaction, and optimize technician staffing by leveraging new technologies and centralized approaches. Here are takeaways from that session.\n\n## Core Challenges with Traditional Maintenance\n\nWorking with unhappy residents to resolve maintenance issues can be an uphill battle, even for the best maintenance teams. We see that residents often submit requests with vague or missing details, forcing technicians to make multiple visits before fixing an issue. This back and forth process is inefficient and drags down average resolution times.\n\nOperators run into a whole new set of complexities when onsite staff gets involved. Sometimes, onsite maintenance is able to solve the problem but doesn’t close the ticket, resulting in duplicated work. Onsite staff might log some service requests themselves, while residents log others, which can lead to inconsistent data and information, difficulties in tracking work orders, and multiple chains of communication.\n\nIn addition, maintenance positions see turnover rates equal to or even higher than leasing positions, creating costly and disruptive gaps in service as operators struggle to backfill vacated positions. Finding and hiring maintenance techs with both technical ability and the soft skills needed to learn new technologies and handle unhappy residents is far easier said than done. And this labor gap doesn’t seem to be closing any time soon, with [the United States facing a massive shortage of skilled labor.](https://www.uschamber.com/workforce/understanding-americas-labor-shortage-the-most-impacted-industries) With that in mind, the way operators handle maintenance needs to change in response to these external pressures—many of which can be solved through centralized maintenance.\n\n## Centralizing the Maintenance Function\n\nUnlike [centralized leasing](https://www.eliseai.com/blog/takeaways-from-part-three-of-eliseais-centralization-webinar-series-centralized-leasing), maintenance tasks cannot always be fully moved off site as maintenance involves management of physical facilities. However, there is still an opportunity for operators to change the way their maintenance team operates by centralizing tasks such as automated work order submissions, maintenance tech scheduling, and performance tracking.\n\nBy moving the initial communication to a centralized location rather than through one to one communication with maintenance techs, property management companies ensure their residents provide thorough and useful diagnostic information from the moment they raise their ticket. By encouraging them to share photos and videos, and walking them through self-diagnostic prompts, operators can either reduce unnecessary technician visits through triaging or ensure their techs know exactly what to expect when they arrive onsite.\n\nCentralizing the intake process leads to consistent categorization of maintenance requests, eliminating inconsistency and facilitating clearer reporting on portfolio-wide trends or recurring property-level issues. It’s far easier to draw concrete conclusions and take proactive steps to mitigate maintenance issues when all of your maintenance data is clean, organized, and tidy. Having centralized maintenance to consolidate all of this information helps you see the forest for the trees rather than getting bogged down fighting little fires.\n\n## Automating Work Orders with AI\n\nAI can be an ace in the hole for overworked maintenance teams, taking work off their plates through proactive triaging and by standardizing the work order creation process. AI tools can be your first responders around the clock, engaging with residents in real time regardless of the time of day. By asking follow-up questions and delivering step-by-step prompts to troubleshoot basic issues like resetting a breaker or cleaning a filter on an AC, your AI may proactively resolve problems without the need to schedule a service call.\n\n[AI powered maintenance tools](https://www.eliseai.com/resources/maintenance?_gl=1*15vka86*_gcl_au*MTUzNTcxMTgxMy4xNzMwNzMyNDkz) can also determine if an issue is urgent and they need to loop someone in after-hours, based on preexisting information about the unit or home in the PMS. For example, a broken toilet in a two bathroom apartment wouldn’t be considered an emergency by an AI due to the availability of a second toilet, which it would know from the apartment configuration. However, the AI would consider a broken toilet to be an emergency if it was the only toilet in the apartment. In these emergency cases, the AI platform makes outbound calls to on-call maintenance technicians, conveying relevant details to expedite the resolution of the emergency issue.\n\nAI also improves resident satisfaction with maintenance support by delivering proactive updates that keep residents in the loop. AI solutions communicate any change in ticket status to residents—comparable to the “pizza tracker” model that companies like Uber and DoorDash have pioneered—which results in increased resident confidence and satisfaction. AI can also solicit reviews immediately after a service is completed from happy residents, which can significantly help operators with their reputation management.\n\n## Optimizing the Performance of Your Maintenance Teams\n\nBeyond implementing AI, there’s a variety of process changes that should be implemented when building a centralized maintenance function. Building advanced dashboards that assign tasks based on each technician’s skill level, availability, or proximity cuts down on idle wait times where technicians are delayed because a supervisor must manually distribute tasks. Gamification can be another useful tool in the operator’s toolbox. Jacob shared that he had seen several PMCs create friendly contests among technicians and teams where they’re evaluated based on metrics such as turnaround time, completion rates, or resident ratings in order to encourage healthy competition while providing benchmarks for performance reviews.\n\nFor operators with multiple assets in close proximity, merging a handful of on-site teams into one larger, specialized crew can help cover gaps in their maintenance techs’ skillsets and reduce time to work order depletion. This “regional” model enables PMCs to deploy resources where and when they are most needed, reducing reliance on expensive external contractors and cutting turnover-induced downtime.\n\n## Key Wins and Results from Centralized Maintenance\n\nOperators moving to a centralized maintenance model can expect to see several key performance improvement indicators. For one, resident satisfaction with maintenance should go up, as receiving real-time updates, the simplification of bilingual interactions, and increased access to information builds trust and loyalty with your residents. This, in turn, can be leveraged as part of a strong reputation management program.\n\nOperators will also gain increased insight into the overhaul physical health of their communities. Leveraging AI to automate work order creation ensures each request includes standard categories and subcategories. This in turn allows operators to gain a clearer picture of trends, like repeat plumbing issues, helping them to build actionable strategies for both short-term fixes and long-term capital planning and efficiency.\n\nImplementing AI and centralized maintenance can also help increase technician retention rates. By ensuring maintenance staff receive more complete information in advance, have increased visibility into scheduling, and are being evaluated on fair performance metrics, overall job satisfaction rises. Building an improved culture mitigates attrition by reducing your technicians’ likelihood to leave in search of a better work environment.\n\n## Looking Forward: The Future of Centralized Maintenance\n\nThere’s still opportunities for significant advancement in the centralized maintenance function as new, improved AI technology comes together with change management strategies. Some property management companies intend to integrate contractors and third-party vendors for specialized repairs, opening the door for AI to handle not just work orders, but also vendor scheduling and bid management. As more AI and automation solutions roll out, property managers and maintenance teams will benefit from close collaboration with vendors to ensure they have the ability to shape tools to match real-world operational needs.\n\n## Standing Up Centralized Maintenance with Support from AI\n\nAs centralized maintenance teams continue to become more and more commonplace, operators will have to weigh the cost of up-front investment in technology against potential payroll savings, better resident retention, and fewer reliance on external services. Property management companies that do invest in AI to help centralize their maintenance operations can expect to mitigate their staffing challenges, cut work order completion times, and elevate their overall service quality. If you’re looking for a best-in-class AI to help build a centralized maintenance function, get in touch with EliseAI today."
}