{
    "title": "Takeaways from EliseAI's \"Pitching to Ownership Groups\" Webinar",
    "author": "Clay Walsh",
    "date": "January 27, 2025",
    "summary": "This article outlines key strategies for pitching AI tools to ownership groups, emphasizing the importance of framing problems, articulating the value of AI, and overcoming objections to drive adoption.",
    "main_content": "# Takeaways from EliseAI's \"Pitching to Ownership Groups\" Webinar\n\nMost multifamily operators are all too familiar with a tech rollout flop. Whether the vendor overpromised and underdelivered or internal change management strategies fell flat, a technology swing and miss can blowback on fee managers and hurt their credibility with the ownership groups that entrust them to manage their communities. Pitching AI tools to owners can seem daunting in light of earlier tech slip ups, especially considering the tight capital environment, the complexity of AI, and the tech-skepticism of many ownership groups. But in today’s property management world, not leveraging AI can be a quick way for fee managers to fall behind their competitors in local markets.\n\n---\n\nJacob Kosior, EliseAI’s Vice President of Client Services and Andrew Doar, an EliseAI Client Strategy Partner, are well acquainted with the uphill battle that is selling tech to ownership groups. With over 20 combined years of multifamily experience they have seen what works and what doesn’t when it comes to communicating value and expectations around tech rollouts. They brought that experience to the table for an EliseAI hosted joint workshop for fee managers called “Pitching to Ownership Groups,” where they shared actionable strategies and resources for third-party managers looking to drive AI adoption across their portfolios. Here are key takeaways from their session.\n\n## Takeaway One: Frame the Problem and Generate Urgency\n\nConvincing owners to buy-in to AI requires a healthy mix of framing, “fear of missing out” (or FOMO), and education. In general, ownership groups tend to minimize or overlook key operational burdens that fee managers are all too familiar with, like high employee turnover, labor shortages, and overreliance on manual workflows. By presenting survey data from organizations like the National Apartment Association property managers can highlight how stress factors like abusive residents, spiraling workload, or constant training for new hires directly impact portfolio financial performance via their impacts on occupancy and collections rates. Jacob had success opening ownership groups’ eyes by telling them that the industry average for leasing turnover often exceeds 50%. When owners realize that their assets will underperform due to the constant training cycles that sap onsite teams’ energy and consistency, it becomes easier to advocate for AI.\n\nFOMO goes a long way towards driving urgency as ownership groups look to “keep up with the Jonses.” For fee managers, explaining to owners that the contemporary rental market has accelerated in ways that older operating models can no longer handle can create a sense of urgency to innovate. Today’s renter expects more than ever as a result of apps like Netflix, Amazon Prime, and Uber, so if an owner’s property cannot match these evolving service levels they risk losing high-value renters to other communities in the market that do meet this level of service.\n\nJacob and Andrew recommended using the framing that “time is the only resource you cannot ask an ownership group for” to crystallize the sense of urgency for AI adoption. By showing how AI can reduce manual admin by 80-90%, allowing for flexible staffing and increased property operating efficiency, you reinforce that accelerating processes is not just an operational “nice-to-have,” but a core business necessity.\n\n## Takeaway Two: Clearly Articulate the Value of AI and Automation\n\nFor many people, multifamily industry or otherwise, AI is still a black box. It’s important to simply and clearly articulate the concept of AI to ownership groups to avoid apprehension or confusion when discussing AI rollouts. Jacob had success conceptualizing AI as a bright new hire right out of college to describe how advanced algorithms can learn from past interactions—both with staff and residents—and rapidly apply those learnings to future conversations. Like any fresh hire, AI is smarter, entrepreneurial, and motivated, but needs some hand holding in the early going to get up to speed. When you conceptualize AI within an existing management framework, you reveal how it augments, rather than replaces, human expertise, and demystify its capabilities and role for ownership groups.\n\nWhile occupancy rate is typically an ownership group’s top metric, Jacob and Andrews stressed that highlighting AI’s contributions towards reducing staff turnover rates and trimming wasted payroll hours is powerful ROI-focused framing. By automating lease follow-ups, application reminders, and delinquency notifications, AI and automation platforms enable onsite employees to focus on relationship-building or high-level issues that directly enhance resident loyalty. This leads to reduced staff turnover expenses, fewer training obligations, and a stronger overall resident experience that results in fewer turns. If you can clearly articulate to an ownership group that using AI to catch lost leads or uncollected rent has a sizable effect on NOI, it can significantly improve your case for technology investment.\n\n## Takeaway Three: Bring the Right Data and Talking Points to Overcome Common Objections\n\nJacob and Andrew shared concrete talking points and data for several of the common objections third-party managers might hear from their ownership groups.\n\n### Objection One: “Our Renters Want a Human Touch”\nWhen owners emphasize “the human touch” it’s important that you contextualize the work that an AI assistant does, and what that work frees up your human team members to do. With an AI covering high-volume, low-complexity tasks like follow-up emails and tour scheduling, your team members can now dedicate their attention to developing the personal connections that differentiate your communities from competitors. Make sure you frame AI as a complementary resource that handles mundane tasks so human agents can focus their effort on building meaningful relationships.\n\n### Objection Two: “It’s Just Another Software System”\nOwnership groups and onsite teams alike are (understandably) tired of working out of a patchwork of point solutions that don’t integrate with your core systems. They might assume AI is going to be yet another login to manage. That’s why you need to explain that robust AI platforms, like EliseAI, integrate with existing property management software, pulling real-time pricing, availability, and resident information to power the conversational AI and automations. By consolidating multiple communication channels—phone, text, email, web chat—into one interface, you’re actually able to reduce the complexity of your tech stack, not add to it. AI effectively serves as a unifying layer that absorbs multiple tasks, eliminating the need to train staff on scattered tools or juggle multiple dashboards.\n\n### Objection Three: “AI is Too New and Untested”\nWhile generative AI has burst onto the scene over the last few years, AI has actually been around for quite a while. Reminding owners that AI has been central to consumer-facing industries like retail and finance for years, powering chatbots, transaction monitoring, and personalized recommendations at scale can help mitigate concerns about AI not being developed enough. Millions of multifamily units already use AI powered leasing or delinquency management tools, with over 415 owners and operators using EliseAI’s products. Citing examples of AI deployment from large REITs like AvalonBay and well-known operators like the Scion Group can help illustrate that the technology is stable and has delivered ROI at scale, also creating the “FOMO” that you need to help get owners excited for AI.\n\n### Objection Four: “We’re Already at High Occupancy”\nIn Jacob and Andrew’s eyes, occupancy alone does not protect an owners’ assets from missed opportunities or inefficiencies. Maybe the leasing office is underwater managing manual tasks which results in high staff turnover rates. Or maintenance request follow-ups regularly slipping through the cracks are driving high turn rates. Even top-performing communities can see improvements in operating costs and resident satisfaction by automating repetitive or time-sensitive processes. AI also helps owners keep pace with the operator down the street that deploys advanced AI and automation tools to engage leads around the clock.\n\n## Takeaway Four: Master Your Timing and Messaging for Presentations\n\nSetting the stage for an AI discussion can make or break an owner’s willingness to try something new. Ensure that AI is an agenda item of its own when discussing with ownership groups, not shoehorned into a routine budget call. Jacob and Andrew also recommended bringing in regional managers, onsite leaders, and tech experts who can set the stage by explaining existing bottlenecks and highlighting opportunities for innovation. Ownership groups often respond well to hearing how actual staff members expect to utilize AI to improve daily operations.\n\nIdeally, you should start these discussions ahead of annual budgeting so owners can see the technology’s line-item cost balanced against projected savings or revenue increases. If a community is in the middle of a key leasing season or has a looming turnover wave, emphasize that implementing AI to fill staffing gaps can save on headcount costs and smooth out any inconsistencies in your leasing workflows. Finally, ensure you’re highlighting duplicated or overlapping software subscriptions that can be terminated once you onboard AI. Customers switching to EliseAI and EliseCRM usually cut their after-hours answering services, call centers, reputation management software, mass messaging tools, self-guided tours, and more, generating substantive tech reduction ROI in many cases without losing any functionality.\n\nIt’s also important that you tailor your messaging to the specific priorities of your ownership group or groups. Some owners may want a shorter payback period, while others might care more about enhancing the resident experience. Tailor the case studies you present to highlight whichever results resonate most for each ownership group. Taking a thoughtful, targeted approach helped Andrew and Jacob demonstrate that they understand their ownership groups’ priorities and were tailoring the solutions they delivered to their unique needs.\n\n## Rolling Out AI with Ownership Buy-In\n\nAI technology is no longer speculative or niche—it is a proven driver of both increased operational efficiency and heightened prospect and resident satisfaction across the multifamily sector. Beyond leveraging FOMO, ensuring you clearly link AI adoption to tangible asset performance and day-to-day operational relief is the surest way to secure ownership buy-in. By illustrating the real costs of staff burnout, missed leads, or delayed rent payments—and backing it up with data or case studies—you can build a compelling story that resonates with ROI-focused ownership groups.\n\nIf you’re a fee manager looking for the best AI solution on the market and for help selling it to your ownership groups, get in touch with the EliseAI team today."
}