{
    "title": "Takeaways from Part Three of EliseAI’s Centralization Webinar Series, “Centralized Leasing”",
    "author": "Clay Walsh",
    "date": "December 17, 2024",
    "summary": "This article discusses key insights from EliseAI's webinar on building a centralized leasing team, focusing on the benefits and strategies for implementing this model in property management.",
    "main_content": "# Introduction\n\nFactors like heightened consumer expectations and an increased focus on capital efficiency in a tight economic environment have put extra pressure on property managers to do more with less. Some operators have moved towards a centralized management model that allows them to move onsite responsibilities to specialized offsite teams, reducing costs and improving operating efficiency. But building a centralized team isn’t as cut and dry as taking agents and moving them to an offsite location—it requires planning, role rescoping, improved tech, and more.\n\nWith that in mind, [Jacob Kosior](https://www.eliseai.com/blog/eliseai-adds-seasoned-multifamily-leader-jacob-kosior-to-executive-team), Vice President of Client Services at EliseAI, continued our Centralization Webinar Series with a lesson on building an optimized centralized leasing department. As the former Vice President of Centralized Services at Cardinal Group Management, Jacob has real-world experience standing up and leading centralized teams. Let’s dive into takeaways from his session, including understanding the basics of centralized leasing, why to consider shifting to a centralized leasing model, how to scale your team, and more.\n\n## What is Centralized Leasing?\n\nCentralized leasing improves onsite efficiency and drives higher NOI by shifting repetitive tasks like lead management and lease administration from onsite teams to specialized offsite teams. Rather than having your onsite leasing teams switch between handling in-person touring and sitting at their computers to manage things like lead follow-ups, tour scheduling, and post-tour communications you can allow them to put the entirety of their effort into providing helpful onsite services. This enables you to build a specialized offsite team with agents who have experience with responsibilities like lead nurturing, fraud prevention, and lease administration.\n\nBy separating the administrative components of the leasing process from the in-person sales components of the leasing process, operators can better play to the strengths of their individual team members. Rather than expecting your leasing agents to be both strong salespeople and detail-oriented administrators, you can disentangle those two roles and build two specialized units designed to do their part of the process exceptionally well.\n\n## Why Centralize Your Leasing Team?\n\nSeveral key factors are driving operators to centralize their leasing teams. One factor is high agent turnover. Whether it’s agents looking for new lease-up opportunities after filling one community, competitive compensation negotiation, or a lack of opportunities for growth, it can be incredibly hard for operators to keep high performing leasing team members. The numbers tell the story—40% of leasing agent roles turn over on a yearly basis. Another major factor driving the adoption of centralized leasing is [rising consumer expectations](https://www.eliseai.com/blog/the-uberfication-of-customer-expectations). Companies like Uber, Amazon Prime, and DoorDash have conditioned the modern renter to expect immediate responses, frictionless booking experiences, and round the clock service—all of which put additional pressure on leasing teams.\n\n[Increased rental fraud rates](https://www.nmhc.org/news/press-release/2024/rampant-increasing-fraud-impacting-rental-housing-costs/) have also motivated some operators to adopt a centralized model, as it allows them to deploy specialized team members who are experienced in fraud screening and lease administration to keep malicious actors out of their communities. Finally, emerging technology designed specifically for centralized teams, including new [AI lead management solutions](https://www.eliseai.com/resources/leasingai?_gl=1*1bm2irk*_gcl_au*MTUzNTcxMTgxMy4xNzMwNzMyNDkz) and [call management technology](https://www.eliseai.com/resources/call-center), has enabled agents to be effective at scale in a manner that just wasn’t possible a few years ago.\n\n## Impact of Implementing Centralized Leasing\n\nThere are a variety of benefits operators should expect to see after centralizing their leasing functions. For one, the overall leasing experience should improve as onsite teams no longer have to manage the most tedious parts of their role, like lead follow-ups, and can spend all of their energy and time delivering excellent in-person tours and resident experiences. This also offers an opportunity for cost reduction through strategic staff deployment in accordance with onsite touring needs. The leasing experience should improve for prospects as a result of quicker follow-ups and more attentive nurturing through the funnel as driven by centralized leasing team members.\n\nSome operators will see an uptick in overall leasing performance as a result of those aforementioned faster follow-ups and fewer missed opportunities. EliseAI mystery shopping data shows that almost 30% of calls to onsite leasing teams are missed, and with half of all callers on average not leaving a voicemail. That’s a massive amount of leads that are being missed entirely, prompting higher-than-necessary marketing spends to accommodate the lead leakage from missed calls and follow-up efforts. Improving call answer rates by 10% or 15% after moving to a centralized leasing model could make a substantive impact on your funnel by preemptively stopping leads from leaking.\n\nIn general, centralized teams have found it easier to train and retain centralized team members, thereby tackling the issue of onsite agent turnover while ensuring consistency in prospect communications by the highly-specialized centralized leasing team.\n\n## How to Implement a Centralized Leasing Model\n\nThere’s three key steps to implementing centralized leasing:\n\n1. Analyze your existing operations and rescope roles to meet community needs\n2. Engage your onsite teams and implement change management best practices\n3. Leverage AI and advanced tech as a force multiplier for offsite teams working at scale\n\n### Analyze Your Operations and Rescope Roles\n\nIdentifying existing operational inefficiencies and overlaps in responsibilities can give you a good starting point for standing up a centralized leasing team. As discussed in part two of our [Centralization Webinar Series on “Role Specialization,”](https://www.eliseai.com/webinar/gated-webinar-centralization-role-specialization) using a [Responsibilities, Accountabilities, Consultations, and Who Needs to be Informed (RACI) chart](https://www.eliseai.com/blog/role-specialization-webinar-takeaways) for each key task of your onsite teams can help you understand where any existing gaps in your leasing process might be. Analyzing lead-to-lease conversions, diagnosing the stage at which most prospects commonly fall out, and looking at communication volume by channel are also good strategies for identifying areas to be addressed by implementing centralized leasing.\n\n### Engage Your Onsite Teams\n\nKeeping your onsite team on the same page during the transition to a centralized leasing model is key in order to reduce uncertainty and drive strong community financial performance during a time of transition. Proactively communicating the scope of the centralization push, how these changes will impact their day-to-day, what their new roles will look like, and who is responsible for owning the technology that helps centralized teams operate at scale can help keep everyone aligned and mitigate concerns over headcount reduction or reduced hours. This is also an excellent opportunity to identify potential future leaders in the organization, team members who adapt well, are open to using new technology, and see the big picture of the centralization effort. Jacob shared that he had success running dedicated focus groups for onsite teams to help keep a strong sense of community and collaboration during the transition.\n\n### Implement AI and Modern Call Center Technology\n\nA new model of working requires new technology. Advanced PropTech solutions, including [AI assistants](https://www.eliseai.com/leasingai), [call center platforms](https://www.eliseai.com/resources/call-center), and [automation-focused CRMs](https://www.eliseai.com/blog/elisecrm-feature-deep-dive), enable centralized teams to efficiently serve multiple communities by surfacing valuable information, autonomously managing redundant tasks, and eliminating operational limitations imposed by legacy property management systems. It’s going to be difficult to build out a centralized leasing team while using outdated systems and a mess of expensive point solutions.\n\nEliseAI’s products are designed to enable centralized teams to work efficiently at scale, automating 90% of all property management tasks for leasing agents and empowering them to lease more units faster. Through a combination of AI assistants and features built into [EliseCRM](https://www.eliseai.com/elisecrm) designed for centralized teams like the [Call Center and adaptive AI driven scheduling,](https://www.eliseai.com/resources/call-center) centralized teams can decrease their reliance on cumbersome tech like IVR, external call centers, and legacy CRM/PMS systems that are built specifically for onsite teams.\n\n## Scaling and Managing a Centralized Leasing Team\n\nDepending on the unique needs and geographical considerations of each operator, centralized teams can operate remotely, regionally, or from corporate offices, with a focus on specialization and performance tracking. Jacob highlighted three models he has seen be the most effective for most operators:\n\n- **Regional Pods:** Best for operators with high-density properties in specific regions. This combines the local expertise of onsite teams with the benefits of scale and centralization.\n- **Corporate-Based Teams:** Works well for operators who want a high level of control over the day to day of their centralized teams. This offers career growth opportunities, but might limit your ability to recruit top talent, as all the agents need to be located near HQ.\n- **Fully Remote Teams:** The fully remote model enables operators who value a wide talent pool, lower overhead costs, and a flexible employee experience. This option is ideal for covering extended hours and providing flexible work options, but can result in a loss of quality control (unless you’re using [agent call scoring tools](https://www.eliseai.com/resources/call-scoring)).\n\nWhen it comes to evaluating performance, establishing a baseline for before and after comparison is key. Ensure you’re gathering leasing data from the months before your [centralization pilot](https://www.eliseai.com/blog/10-factors-to-consider-when-selecting-communities-for-a-centralized-services-pilot) like phone answer rates, lead-to-tour conversions, and average response times so you can evaluate the performance of your centralized leasing team and make adjustments to strategy as needed.\n\n## Change Management Best Practices for Centralized Leasing\n\nEffective change management during a centralization push can help minimize friction and maintain high productivity levels. Ensuring that onsite roles maintain their leasing commissions while incentivizing centralized teams with specific operational KPIs keeps all your team members on the same page and in their own clearly defined swim lanes. Communicating that AI is a supplemental tool and not a replacement for human agents is key to help mitigate potential concerns with the onsite teams. You can also rely on natural attrition to scale down onsite teams as centralized roles expand and roles are rescoped.\n\nGetting your centralized teams up to speed in a quick and standardized manner can help ensure you see value from centralized leasing quickly. With that in mind, Jacob recommends that centralized teams should participate in weekly calls, use shared communication tools, and access AI-powered knowledge repositories in order to rapidly integrate themselves into your property management operations. This is particularly valuable if they are new to the organization, but onsite team members moving to offsite roles will also need additional training to make sure they understand the new scope of work they’re responsible for.\n\n## Building Better Centralized Teams with EliseAI’s Centralization Webinar Series\n\nCentralized leasing offers transformative potential for the modern property management operator, making it easier to reduce the impact of staff turnover and meet heightened customer expectations in a competitive climate. But building a centralized leasing team is only one part of the picture—there’s still resident services to think about. Check out part four of EliseAI’s Centralization Webinar Series, [“Centralized Resident Services,”](https://www.eliseai.com/webinar/gated-webinar-centralized-residential-services) for more insights on building a centralized resident services team. And if you’re looking to generate additional revenue from your centralized teams, part five of our series, “Commercialization of Centralization,” has everything you need to know about building new revenue streams by commercializing your centralized teams.\n\nInterested in building centralized teams, but not sure what AI and modern PropTech solutions to add to your tech stack? Get in touch with the EliseAI team to learn more."
}