{
    "title": "The Importance of After Hours",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "This article discusses the necessity of after-hours support for leasing offices and how AI can provide a solution to enhance customer service and lead management.",
    "main_content": "# The Importance of After Hours\n\nIt is a truth universally acknowledged that, during the workweek, people would rather inquire about communities after the working day. Despite this, many leasing offices hold to the same 9-5 hours that the rest of the world operates on. This limits their effectiveness in handling incoming leads and ultimately contributes to fewer leases and lower overall occupancy.\n\nIf someone is calling the office once they get home from work or shooting off an email after dinner, they won’t get a response until the following morning when the leasing office reopens. That’s simply not good enough in this day and age, in a time when people expect immediate service. The internet has upended expectations around customer service. Because websites can be visited at all hours of the day and night, people expect that customer service or sales teams should also be operating continuously.\n\nLeasing offices have to meet prospects where they are, not where they’d like them to be. If people are browsing apartments outside of working hours, then communities need to be able to respond outside of working hours. It sounds simple, and it is, but it is nonetheless missed by a lot of management companies.\n\nBut this necessity doesn’t mean that management companies need to bear the expense of 24/7 staffing, or engage in a strange barbell hiring strategy to optimize for early mornings and late evenings, or spend vast sums of money on call centers. All of those responses are not solutions at all but simply create further problems.\n\nArtificial intelligence provides a true solution. Computers never sleep and they never get tired. They can respond at all hours and handle inquiry volumes far in excess of even the most diligent human being.\n\nBut not every computer is created equal. Chatbots simply spit back pre-programmed responses, lending an interaction an artificial feel. There’s nothing exceptional about an experience with a chatbot and it will not be impressive to prospects that they were able to get robotic responses in return nor will they feel as though their inquiry was taken seriously.\n\nConversational artificial intelligence, on the other hand, combines human-like responses with the industriousness of a computer, enabling your community to respond to all inquiries at all hours of the day and night."
}