{
    "title": "The Build-to-Rent Shift: What Does It Mean for the US Housing Market?",
    "author": "Clay Walsh",
    "date": "February 24, 2025",
    "summary": "This article explores the rise of the build-to-rent (BTR) sector and its anticipated impact on the US housing market in 2025 and beyond.",
    "main_content": "# The Shift to Build-to-Rent: What Does It Mean for the US Housing Market?\n\nRising housing prices, driven by low supply and prohibitively high interest rates, have left many prospective home owners in a state of limbo as they wait for mortgage rates to drop and for new supply to hit the market. Many renters, in response to these conditions, have looked to single-family rental homes that combine the space of a freestanding house with the affordability of rental housing as a stepping stone to homeownership. The spike in demand for single-family rentals (SFR) has driven a massive spike in investment in the build-to-rent (BTR) space, with a [total of over 110,000 BTR homes currently under construction](https://www.point2homes.com/news/research/report-single-family-rentals-under-construction.html) in the United States. That supply coming online would represent a 53.5% total increase in the amount of BTR housing currently available, with certain states like Nebraska and Rhode Island slated to nearly double their inventory of BTR housing in the next few years.\n\nGenerational shifts are also a key contributor to the growth of the BTR segment over the last few years, as millennials look for the space and amenities associated with houses while baby boomers continue to hold onto their homes, driven by massive spikes in asset value and shortages in senior housing deliveries. Further deployment of capital into the BTR sector by existing SFR companies like Progress Residential and Invitation Homes, as well as increased involvement from institutional investors and asset management are also driving spikes in the space in 2025 and beyond. Put together, all of these factors indicate continued growth for the BTR sector on the horizon.\n\n## Intro to Build-to-Rent Housing\nBuild-to-rent housing refers to residential properties (frequently entire communities) developed with the primary intent of renting them out rather than selling them to individual homeowners. Unlike traditional SFR homes that were acquired from the original homeowner, BTR properties are typically constructed under a single developer or institutional investor who retains ownership and either manages the properties or brings on a fee manager. These projects often resemble single-family home neighborhoods or townhome complexes, with communal amenities like shared recreational spaces, fitness facilities, and community services. Given the relative unaffordability of the current housing market, BTR has provided an alternative path for some renters to enjoy living in a home on a rental budget.\n\n## The Rise of Build-to-Rent Housing\nIn the wake of the Great Recession of 2008, private and institutional investors capitalized on high foreclosure rates and acquired distressed homes en masse. This spike in institutional single-family rental ownership created the SFR market as we know it. While [80% of all detached single-family rental houses](https://wolfstreet.com/2024/04/09/the-biggest-landlords-of-single-family-rental-houses-and-multifamily-apartments-in-the-us/) are controlled by mom and pop ownership with less than 10 homes under management, the proportion owned by large companies with over 1,000 units has grown over the past few years.\n\nToday, there’s a few large players in the SFR rental market. Several private entities, like Progress Residential (85,000 homes) and FirstKey (50,000 homes) own a large inventory of SFR homes, and there are several large publicly traded REITs like Invitation Homes (80,000 homes) and American Homes 4 Rent (60,000 homes) that own a significant number of units. In addition, Blackstone acquired Tricon Residential in 2024, driving increased institutional ownership in the space and further development of the BTR sector. With their significant financial resources these companies have largely shifted their approach from acquiring SFR homes to constructing them, driving the continued growth of the BTR sector.\n\n## Regional Build-to-Rent Trends\nAccording to [a recent report](https://www.point2homes.com/news/research/report-single-family-rentals-under-construction.html) on upcoming and current SFR construction, the Sun Belt continues to dominate new BTR developments, with Texas leading the way with 20,000 BTR homes under construction. Steady job growth, relatively affordable land, and strong population inflows are fueling the demand for rental homes in these areas, leading to capital deployment by both institutional investors and BFR developers. This surge is reshaping local housing markets by creating dedicated rental communities that offer both the amenities and space typically associated with homeownership at affordable prices, with submarkets like the suburbs of Houston and Dallas expecting to see continued BTR growth in 2025.\n\nCoastal markets are also seeing an uptick in BTR activity, albeit at a more modest pace. High land cost in states like New York, Rhode Island, and New Jersey, coupled with strict zoning regulations can pose challenges. However, demand from those seeking BTR housing remains strong. As a result, a growing number of BTR projects are appearing in suburban pockets around major coastal cities. These regional discrepancies underscore how varying economic factors and local policies continue to shape the broader expansion of BTR communities throughout the country.\n\n## Increased Institutional Involvement in the Build-to-Rent Space\nOver the past few years, several prominent institutional investment companies have entered the BTR market, utilizing their substantial funds to partner with leading developers and construction management firms to build elaborately planned BTR communities. [JP Morgan recently entered the BTR market](https://www.builderonline.com/money/capital/massive-jp-morgan-partnership-reshapes-the-build-to-rent-market_o) by partnering with Georgia Capital to found a BTR company called Laseter Development Group, which is looking to capitalize on increased demand in the Southeast as a result of nationwide migration patterns. This is in addition to the portfolio of 6,000 SFR homes JP Morgan has already acquired over the past few years, indicating their interest in further developing their housing portfolio.\n\nWhen combined with other large institutional investors with an interest in the BTR space, including Carlyle, Cerberus, Blackstone, and more, it becomes apparent that the financial industry sees SFR homes as a strong investment opportunity in years to come. With changing demographic patterns and an uncertain macroeconomic outlook (including fewer than expected interest rate cuts in 2025), this investment in the BTR and SFR space for institutional investors is looking to be a prescient one.\n\n## What Does Build-to-Rent Mean for Multifamily?\nThe SFR industry has, by and large, expanded organically as institutional investors acquired new homes across the country. In many cases that means these homes aren’t proximate to each other, and can’t leverage any sort of communal areas or land to offer amenities or other services. However, the BTR industry can support a semi-multifamily setup, where entire communities are preplanned around communal spaces and to take advantage of shared services like maintenance, landscaping, and pool cleaning. BTR developers can also differentiate their communities with amenities that preexisting SFR homes don’t have as a result of their lack of proximity. A well designed BTR development can, in some ways, function like a multifamily community, allowing the operator to leverage [centralized leasing](https://www.eliseai.com/blog/takeaways-from-part-three-of-eliseais-centralization-webinar-series-centralized-leasing) and [centralized resident services](https://www.eliseai.com/blog/takeaways-from-part-four-of-eliseais-centralization-webinar-series-centralized-resident-services) models in order to improve the living experience at the development.\n\n## The Future of Build-to-Rent\nExpect to see further capital deployment from both REITs and institutional investors into the BTR space over years to come as the US continues to manage a shortage of housing units. With shifting demographics and migration patterns, the unaffordability of homes given current market prices and interest rates, and more renters staying renters by choice, we expect the BTR sector to continue to flourish in the years to come. And with several of the largest SFR and BTR companies in the US, including [Invitation Homes, using AI to improve their resident experiences](https://www.reit.com/news/articles/invitation-homes-using-tech-to-elevate-the-resident-associate-experience), we are optimistic that SFR operators will continue embracing the use of new technologies to deliver best-in-class resident experiences."
}