{
    "title": "The Leasing Journey",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "This article explores the complete leasing journey for multifamily management companies, emphasizing the importance of optimizing each stage from initial contact to move-in.",
    "main_content": "# The Leasing Journey\n\nWhile the goal for multifamily management companies is getting a signature on a lease, the path to that end goal starts a lot earlier. Leasing teams and management company executives have to pay attention to every stage of the leasing journey in order to maximize their occupancy and NOI.\n\nThe leasing process truly begins with marketing. The competition for tenants is fierce across various ILS providers and social media platforms, with buildings and management companies bidding for the same pool of prospective tenants. But marketing spend only gets a potential tenant so far - making contact with the community.\n\nOnce the prospective tenant has contacted the community, digital marketing efforts lose much of their value. What matters now is the prospective tenant’s experience with the leasing team. Getting a tenant to schedule a tour can be a difficult task. It requires managing all the inbound leads across different methods of communication, processing their requests and requirements, and simultaneously managing staffing levels to provide coverage for all prospective tenants and other community needs.\n\nAny failures to complete any element of it will obstruct getting a tenant signed up for a tour and waste the marketing spend that was used to get them through the door. This complicated logistical workflow can be time-intensive if it isn’t automated and can result in mistakes and omissions. People will rarely rent an apartment without having toured it in person. If a community’s lead-to-tour rate is low, then this will impact the community’s occupancy and profitability.\n\nOnce a tour is scheduled, it is up to the leasing team to deliver a best-in-class onsite experience. The tour will be one of the most significant inputs to the prospective tenant’s ultimate leasing decision.\n\nBut a tour is not enough to guarantee a lease. Prospective tenants are likely to be shopping around at a number of different buildings in the same area. In order to maximize the value of a tour, buildings need to follow up consistently with tenants after the tour, otherwise they risk letting the tour go to waste. Automation can also play an essential role in filling this need, as conversational AI can automatically send personalized follow-ups to prospective tenants after their tour.\n\nAutomation has an important role to play in this entire journey from marketing to following up after a tour and getting them to consider a lease. Communities and property management companies need to make sure they are maximizing the quality of the prospective tenant’s experience at every stage in order to deliver on NOI."
}