{
    "title": "The Hidden Costs of Using Call Centers",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "This article explores the inefficiencies and hidden costs of call centers in property management, while highlighting how AI can provide better solutions.",
    "main_content": "# The Hidden Costs of Using Call Centers\n\nLike so many modern tasks, the first steps in the leasing process take place online. Because virtually anyone can explore any property at any time, management teams are constantly fielding inquiries from tech-savvy individuals who expect to be satisfied quickly. The change has created a demand for more inbound support. Many companies have turned to call centers, the centralized offices that process large volumes of inquiries by phone. But enjoyable hold music can't overshadow the fact that they are an ineffective and old-fashioned way to solve customer service issues.\n\nCall centers as we know them date back to the 1960s. They rely on complex phone systems operated by a network of agents to solve issues. The quality of service can change from person to person and largely depends on individual personalities and how well each person understands your business. Computer technology has led to some improvements, but the idea that long waits to have phone conversations with overworked agents is the only way to qualify leads and resolve issues is as dated as the business model itself.\n\nHere, we explore the hidden costs of using call centers and explain how intelligent AI is filling in the gaps.\n\n### High Costs\n\nIf you want to establish a call center as a touchpoint, you can either establish one in-house or outsource. You'll be tasked with paying salaries, overhead, and initial setup costs in both cases. Call centers are not plug-and-play, so you'll need to recruit, train, and onboard customer support agents, which can take weeks. You'll pour valuable resources into the process well before taking a single call.\n\nAccording to Glassdoor, the average customer service representative in the United States earns $49,116 per year while customer service managers make $68,703 each year plus benefits. For a team of five (four agents and one manager), you’ll spend about $265,167 each year on salaries alone. Outsourcing call centers can reduce some of those costs, but they are still far from cheap, running from $25/hour-$65/hour per call center representative.\n\nThe roadblocks don't end when your team is set up. Agent turnover is a persistent issue at call centers and maintaining regular staffing numbers can be a challenge. Individuals are less inclined to stay in call center jobs if there are limited learning opportunities, unfavorable work cultures, low wage increases, and other factors beyond management's control, like more attractive job offers. To build a dedicated staff, you'll have to ensure that employees feel fulfilled in their roles and spend money on the kinds of benefits that compel them to stay. Every time you lose an agent, you'll need to go through the recruitment and training process or suffer the consequences of reduced staff.\n\n### Human Error\n\nWhen you rely on a call center, you are putting vital business functions in the hands of a stranger. It becomes difficult to monitor quality assurance and implement behavioral policies. If the call center agent is having a bad day or hasn't taken the time to read their training manuals, callers will receive subpar service that can taint the way they view your business. Losing leads due to poor customer service and the cost of re-acquiring prospects can also significantly impact your bottom line.\n\nOutsourced call center agents are often assigned calls for multiple businesses. Therefore, their time and attention may be divided throughout the workday. They may never have time to focus solely on your business or become as passionate about your vision as your core team. When prospects call customer service, they want to speak with a sympathetic listener who knows how to answer their questions. They'll notice distracted agents right away.\n\nThe standards for background checks differ between countries and states and may even change from company to company. Depending on who you choose to work with, confidential or sensitive information may be left unsecured. In real estate, that can include credit checks, tax returns, sensitive bank information, and more. Security breaches can lead to expensive legal battles and, even worse, cost you client trust.\n\n### Outdated Tech and Performance Measurements\n\nMany call centers run on outdated technology. Those built before the digital revolution often lack the tools necessary to support modern customer engagement or cloud exchanges. That can mean longer wait times in the absence of automated menu options or voice commands. Without cloud technology, you’ll have to rely on servers you don’t own that are housed in buildings thousands of miles from your office to keep your prospects’ information secure and go through additional steps to handoff leads.\n\nCall centers have traditionally measured success according to customer satisfaction, first response time, and average handle time. While those metrics are important, they aren't revenue focused. To track earnings, management teams should seek solutions that allow them to qualify leads over time, note reductions in contact per inquiry, score agent happiness, and process referrals. Clear links between leads and lease signings are key for property management teams to scale.\n\n### Conversational AI as an Alternative\n\nConversational AI is more popular than ever in the multifamily marketplace. During the pandemic, call centers struggled to keep up with the volume of requests and lacked the technological infrastructure to move operations away from a single location seamlessly. Rather than losing business, property owners quickly warmed to using conversational AI such as Meet Elise to fill in the gaps.\n\nConversational AI uses machine learning to collect information from its interactions to improve over time and employs natural language processing (NLP) to compute language and produce more focused and personalized messaging.\n\nNot all customer inquiries require the same amount of attention. AI makes sense of simple questions and answers them quickly, allowing your team to deal with more complex ones. Conversational can also handle multiple requests at once. Everyone's needs are met, and you reserve your team's energy for where it is applied best.\n\nOne of the leading benefits of conversational AI is the ability to create custom experiences for your clients. That means you can adjust the language and tone of the technology to ensure that every interaction is as warm and informative as you choose.\n\nThe most celebrated part of conversational AI is its ability to operate outside of regular business hours. The computer-based technology can work 24/7 to answer straightforward questions and organize more complex requests to handoff to your agents. When prospects know that their requests are being taken as seriously at midnight as they are at 12pm, they’ll gain a new respect for your business.\n\nTurn customer conversations into lease signings with Elise, our dedicated conversational AI tool for multifamily property management. Learn more here."
}