{
    "title": "The Office-to-Apartment Conversion Boom: What Multifamily Leaders Need to Know",
    "author": "Clay Walsh",
    "date": "March 7, 2025",
    "summary": "This article explores the significant trend of office-to-apartment conversions in the U.S., driven by high office vacancies and a housing shortage. It discusses key market drivers, regional hotspots, and the economic and policy considerations surrounding these conversions.",
    "main_content": "# The Office-to-Apartment Conversion Boom: What Multifamily Leaders Need to Know\n\nOffice-to-multifamily conversions have emerged as one of the most significant real estate trends in recent years, reshaping the multifamily housing market in cities across the U.S. The driving forces behind this shift include record-high office vacancies due to remote work, a severe housing shortage, and an increasing number of public incentives aimed at making conversions more feasible. With over 70,000 new apartment units projected from office conversions in 2025, multifamily operators should be paying close attention to this rapidly evolving market.\n\nWhile conversions won’t single-handedly solve the housing crisis or eliminate office vacancies, they offer a unique opportunity to repurpose underutilized buildings and revitalize struggling downtown areas. However, navigating the complexities of zoning laws, financial feasibility, and design constraints means conversions are far from a silver bullet for all the issues plaguing the office rental sector. Today, we’ll dive into the factors driving this trend, examine the logistical considerations that go into office-to-apartment conversions, and look at the impact of the overall office-to-apartment push on the multifamily sector.\n\n## Key Market Drivers Fueling Office-to-Residential Conversions\n\nWe see several key factors driving more and more office owners to convert their unrented office spaces to multifamily housing. Four primary factors stand out: changing work trends and behaviors, housing shortages in major metros, the age of existing office supply, and pro-conversion policy decisions.\n\n### The Office Market’s Decline and Rise of Remote Work\n\nSince the pandemic office utilization has significantly declined, with national vacancy rates reaching all-time highs (13.3% in early 2024) and some downtowns, such as San Francisco, seeing vacancies above 30%. While certain cities, like New York, have seen improved performance for office spaces as more organizations call workers back to their offices, the overarching trends indicate that hybrid work is here to stay. Overall, demand for traditional office space has plummeted in many major metropolitan markets, rendering many buildings financially unsustainable given their lack of tenants.\n\nThis situation has led to distress in the office sector, forcing owners to consider alternative uses, including residential conversions. Buildings that once housed 9-to-5 workers are now being reimagined as mixed-use communities, adding multifamily supply and providing a financial lifeline to ownership groups who otherwise might find themselves defaulting on loans.\n\n### A Housing Supply Crisis in Major Metro Areas\n\nAt the same time that the office market craters, the U.S. faces a massive housing shortage, with an estimated 1.5 million units needed to meet demand. High mortgage rates have locked many would-be homebuyers into renting, further straining the already tight multifamily market. The [build-to-rent industry](https://www.eliseai.com/blog/the-build-to-rent-shift-what-does-it-mean-for-the-future-of-the-us-housing-market) is picking up steam, but for densely packed urban areas there’s little room for new freestanding homes. Cities such as New York, Washington, D.C., and Los Angeles are experiencing extreme rent pressure, making conversions an attractive solution to add housing supply in desirable locations. Unlocking tens of thousands of units for the multifamily rental sector could make a substantive dent in high rental prices in certain markets in the U.S.\n\n### Existing Office Stock Begins to Show Its Age\n\nOne major trend we’ve seen in the office markets is a [“flight to quality,”](https://www.bizjournals.com/bizjournals/news/2025/02/13/flight-to-quality-office-market-leasing-activity.html) as companies looking to sign new office leases take advantage of lowered prices to upgrade to newly constructed Class A buildings. These Class A landlords, who once were able to charge a premium for their spaces, have had to offer significant discounts to attract tenants in a post-COVID environment. That means that many Class B and C office buildings, particularly those built between the 1950s and 1980s, lack the features and amenities required to attract modern commercial tenants given the relative affordability of Class A assets.\n\nRather than remake their outdated layouts and replace their aging mechanical systems, Class B and C assets are often more valuable as residential properties than as office spaces given the relative costs to convert the buildings. We’ve seen success in past conversion waves, like New York City’s 1990s transformation of Lower Manhattan’s Financial District, so multifamily managers should expect to see more former Class B and C supply come online in the next few years.\n\n### Public Incentives and Policy Support\n\nGovernments at all levels are recognizing the potential of conversions to help solve urban real estate imbalances. Cities like Washington, D.C., and Chicago have rolled out tax abatements, zoning reforms, and direct subsidies to encourage adaptive reuse. At the federal level, HUD has mobilized $35 billion in lending capacity to support conversions, while Congress is considering new tax credits to further incentivize projects. Increased government incentives to undergo office-to-apartment conversions should continue to drive investment in the sector, particularly if the government views it as a potential lever to lower housing prices.\n\n## Regional Hotspots and Conversion Trends\n\nConversions are concentrated in urban centers where office distress intersects with high housing demand. Here’s a few of the hottest markets for office-to-apartment conversions.\n\n### New York City\n\nNew York City currently has the largest pipeline of conversions, with over 8,000 units in progress. The city is considering major zoning reforms to facilitate more conversions, with Mayor Eric Adams aggressively promoting his [“City of Yes”](https://www.nyc.gov/site/planning/plans/city-of-yes/city-of-yes-overview.page) plan that would overhaul the way new developments are zoned.\n\n### Washington, D.C.\n\nWashington, D.C is home to some of the most aggressive conversion policies, including a 20-year tax abatement for qualifying projects. The first three projects approved under D.C’s “Housing in Downtown” initiative will save developers roughly $125 million in taxes over two decades. With the federal government continuing to exit existing office leases in D.C, expect developers to jump on these lucrative tax credits and develop more multifamily units from existing office buildings.\n\n### Chicago\n\nThe LaSalle Street Reimagined initiative is converting office towers in the Loop into mixed-income housing, supported by Tax Increment Financing (TIF) subsidies. Chicago’s TIF subsidies are also positioned to ensure enough affordable housing is developed, mandating that any office-to-residential conversion using TIF dollars requires 30–35% of the converted units to be affordable.\n\n### Los Angeles\n\nLA has a long history of successful adaptive reuse projects, thanks to its 1999 Adaptive Reuse Ordinance. Dozens of old office and industrial buildings in LA have been successfully turned into lofts and apartments over the last two decades under their streamlined regulations. Today, LA remains active, with ~4,400 units in the office-to-apartment pipeline through 2025 (third most in the U.S.).\n\n### Philadelphia\n\nPhiladelphia’s Center City has a wealth of older, smaller office buildings ripe for conversion. While it lacks a streamlined adaptive reuse ordinance, the city offers a tax abatement on improvements that has helped spur roughly 3,000 units in the pipeline. These transformations are breathing new life into underutilized areas of the city and bolstering downtown revitalization efforts. Developers are capitalizing on strong rental demand and relatively affordable Class B/C offices, making office-to-apartment conversions an increasingly popular solution in the “City of Brotherly Love.”\n\nWhile most conversions occur in urban centers, some suburban markets are exploring mixed-use redevelopments, where outdated office parks are being transformed into live-work-play communities. Still, multifamily professionals should expect to see urban housing inventory feel the most significant impact of the office-to-apartment conversion trend.\n\n## Economic and Financial Considerations of Office-to-Apartment Conversions\n\nUnfortunately for the real estate companies in the multifamily industry, converting an office building into apartments is not just as simple as throwing in a few walls and calling it a day. Construction costs typically range from $250,000 to $300,000 per unit, making conversions financially viable only if the building is acquired at a steep discount. Older, smaller office buildings with efficient floor plans tend to be the best candidates, while large, deep office floor plans often require costly reconfiguration.\n\nHigh interest rates have also added new hurdles to conversion financing for multifamily owners, making capital more expensive. Traditional lenders view conversions as risky due to construction uncertainties, meaning many projects rely on public subsidies, tax credits, or innovative deal structures. Despite these challenges, successful conversions can yield competitive returns, particularly in high-demand rental markets.\n\nEarly data suggests strong demand for converted apartments, particularly in downtown locations where residents value walkability and access to amenities. Leasing performance has been solid across major metros, and institutional investors are increasingly viewing conversions as a viable asset class, particularly for workforce and mixed-income housing projects.\n\n## Policy Considerations and Future Outlook\n\nAs discussed before, many cities are actively modifying zoning laws to streamline conversions. New York, Chicago, and Washington, D.C., have led the way with targeted zoning updates, while Los Angeles’ Adaptive Reuse Ordinance remains a model for other markets.\n\nThe waning days of the Biden Administration saw them push for adaptive reuse, including a $35 billion funding initiative and potential new tax credits for conversions, but whether or not the current administration decides to continue down this road is yet to be seen. However, we do are expecting to see state and local governments continue to expand their incentive programs to offset high construction costs in 2025 and beyond.\n\nWhile conversions are not a silver bullet for the office market downturn, they represent a meaningful tool in the urban revitalization toolbox. Conservative industry projections suggest that, at most, 5–7% of office stock may be suitable for residential conversion, meaning multifamily developers are going to need to continue to build new communities to bring costs down. However, as office distress continues, more buildings are likely to enter the pipeline. For multifamily executives, conversions present a unique opportunity to acquire well-located properties at a discount and repurpose them for high-demand rental housing. The key to success lies in careful site selection, creative financing, and leveraging public incentives to make the numbers work.\n\n## What Multifamily Leaders Should Do Next\n\nFor senior property management officials and multifamily executives, now is the time to assess how office conversions fit into your investment and development strategy. We expect developers who look to get in on projects in cities with both high office vacancy and strong rental demand, particularly where public incentives are available, to reap the rewards of the office-to-apartment pipeline. It is important to note that not every office building is a good candidate, so multifamily developers should prioritize properties with efficient floorplans, strong location fundamentals, and manageable conversion costs to ensure they see ROI on their investments.\n\nAs the real estate landscape continues to evolve, office-to-apartment conversions will play an increasing role in reshaping urban housing markets. Multifamily leaders who stay ahead of this trend stand to benefit from a unique and growing opportunity to expand their portfolios while contributing to the revitalization of America’s downtowns. And for multifamily real estate companies looking to improve their margins at these office-to-apartment conversions, EliseAI has a full suite of AI and automation solutions designed for the multifamily industry."
}