{
    "title": "The 5 Top Insights from a Nationwide Mystery-Shop",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "This article shares key insights derived from a nationwide mystery shopping survey involving 132 communities, highlighting trends in response times and engagement practices within the property management industry.",
    "main_content": "# The 5 Top Insights from a Nationwide Mystery-Shop\n\nOur team recently completed a nationwide mystery shopping survey, and I want to share some of our top takeaways.\n\nOur total dataset comprised 132 communities under 44 different property management companies, and ran the range of communities, including: city, suburban, large, small, and luxury to class C properties.\n\nIf you’re on this mailing list, there’s a good chance that your community or a community in your portfolio was included in our survey. While our generalized data is below, if you want to see how your particular company performed, head over [here](https://www.meetelise.com/get-a-demo).\n\n**1.) Average Response Time was 11.8 hours**  \nWhile we know we have a lot to improve on and are largely doing our best, in the era of the [anxious millennial](https://theanxiousmillennial.podbean.com/), is this really a response time we should feel good about?\n\n**2.) Autoresponders Improved Response Time, but Didn’t Close the Loop.**  \nThere was a range of solutions in place to cut down on response time, including both autoresponders and chatbots. Yet, while communities which deployed these solutions had faster initial response times, it just seemed to create more work for humans to do: most of these inquiries were never responded to fully.\n\n**3.) Only 20% of Teams Responded in Entirety**  \nWe asked 4 questions around security deposit, pet policy, availability, and floor plans. While many teams answered one or two out of the four, the vast majority didn’t answer in full.\n\n**4.) Only 43% Followed Up**  \nOverall, well under half of communities (Only 19 of the 44) followed up with prospective renters. If your community was among those 19, kudos to you and your team.\n\n**5.) One Third of Properties Never Responded At All**  \nThis stat is scary enough per se, but with consumers now used to on-demand apps like Uber and Lyft, Doordash and Grubhub, it begs a moment of reflection... when does poor response time become unsustainable?\n\nOverall, the data shows that being a renter in America is a recipe for uncertainty (as if there wasn’t enough uncertainty already.) While those of us in the industry have become accustomed to these long wait times and inconclusive back and forth salvos, many anxious renters are not.\n\nAs [Jud Brewer](https://hbr.org/2020/05/are-you-stuck-in-the-anxiety-distraction-feedback-loop) writes in the Harvard Business Review:  \n> Uncertainty makes you feel anxious. Anxiety urges you to do something. In theory, that urge is there to drive you to gather information.\n\nNot only is it frustrating for prospective renters, uncertainty can impact the bottom line of our communities: Consider that even Apartments.com offers this advice to prospective renters who don’t get a response from a property manager: “[Move on...](https://renterhelp.apartments.com/article/255-what-do-i-do-if-a-property-manager-never-answers-the-phone-or-responds-to-emails)”\n\nFor those of you who are doing a great job responding, well done! For those of you with room to improve, MeetElise provides Conversational AI solutions for property managers. Our software suite uses AI to help answer every renter’s questions, in entirety, within 5 minutes or less, 24/7."
}