{
    "title": "The Top 4 Leasing Automation Themes from Optech 2020",
    "author": "Nate Shames",
    "date": "January 27, 2023",
    "summary": "This article reviews the key themes discussed at Optech 2020 regarding leasing automation, highlighting significant trends and insights from industry leaders.",
    "main_content": "# The Top 4 Leasing Automation Themes from Optech 2020\n\nAt NHMC Optech several weeks ago, we heard some of the top practitioners in our industry shine light on the biggest technology trends. Leasing Automation was one of the biggest topics of the conference, and here are four themes we heard most often.\n\n---\n\n_Want [more stats?](https://www.meetelise.com/get-a-demo)_? We’ve got plenty.\n\n---\n\n## 1.) Up to 10% Increase in Applications\nA repeated theme was clients who have deployed Leasing Automation technology such as MeetElise had seen a substantial uptick in applications.\n\n> Looking at properties rolling onto AI products and looking at properties not on it, we saw an 8-10% increase in applications with properties on AI products during 2020 vs. ones that weren't on it.\n> \n> _Laurel Howell, VP Marketing, Bell Partners_\n\n## 2.) Reduction in Call Center Volume\nAccording to our internal data, we’ve seen as high as [48% of all leads](https://mailchi.mp/cb32c3c468aa/who-answers-your-leads-after-hours) submitted after 5 p.m., and that Leasing Automation reduces after hours call volume by up to one-third. We heard this echoed by speakers as well:\n\n> [It] really is amazing the hundreds of thousands of interactions it can handle, even at 2 a.m., and relieves our onsite folks to focus on touring and questions that are more specialized.\n> \n> _Karen Hollinger, SVP Strategic Initiatives, AvalonBay Communities_\n\n## 3.) How to Invest Leasing Agent’s Additional Bandwidth\nBy removing the time burden on leasing agents, leasing automation opens up the options of positioning them for higher-return activities, such as having agents spending more time on tours and more time selling:\n\n> If we increase effectiveness of salespeople, we can lower expenses in marketing and lower turnover.\n> \n> _Matthew Mehon, Director of Marketing and Leasing, Waterton Residential_\n\n## 4.) Change Management is Key\nA repeated theme at Optech was that most successful companies in the leasing automation space have faced change head on. Leasing Automation upends huge portions of how onsite staff currently spend their days, as well as their fundamental priorities. Change Management was key to successful deployments."
}